--- src/client.rs
+++ delete ! in AtprotoOAuthClient::send_xrpc_request
@@ -997,17 +997,17 @@
         let mut url = Url::parse(pds_endpoint)
             .map_err(|e| TokenError::Http(format!("Invalid PDS endpoint: {e}")))?;
         let trimmed_nsid = nsid.trim_start_matches('/');
         // Preserve any base path on the PDS endpoint (e.g. `https://host/pds`) so
         // sub-path deployments resolve to `/pds/xrpc/...` and the DPoP `htu` matches
         // the actual request target.
         let base_path = url.path().trim_end_matches('/');
         url.set_path(&format!("{}/xrpc/{}", base_path, trimmed_nsid));
-        if !query_params.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */query_params.is_empty() {
             url.query_pairs_mut()
                 .extend_pairs(query_params.iter().copied());
         }
         self.send_dpop_request(
             session.dpop_key(),
             reqwest::Method::GET,
             url.as_str(),
             Some(session.access_token()),
