--- src/crypto.rs
+++ replace base64url_decode -> Result<Vec<u8>, CryptoError> with Ok(vec![])
@@ -105,20 +105,17 @@
 ///
 /// ```
 /// use skyauth::crypto::base64url_decode;
 ///
 /// let decoded = base64url_decode("AAEC").expect("valid base64url");
 /// assert_eq!(decoded, vec![0x00, 0x01, 0x02]);
 /// ```
 pub fn base64url_decode(input: &str) -> Result<Vec<u8>, CryptoError> {
-    URL_SAFE_NO_PAD
-        .decode(input.trim())
-        .or_else(|_| URL_SAFE.decode(input.trim()))
-        .map_err(|e| CryptoError::Base64Decode(format!("Invalid base64url data: {e}")))
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes a URL-safe Base64 string into a fixed-size byte array.
 ///
 /// # Errors
 ///
 /// Returns [`CryptoError::Base64Decode`] if decoding fails or the output size does not match `N`.
 pub fn base64url_decode_fixed<const N: usize>(input: &str) -> Result<[u8; N], CryptoError> {
