--- src/client.rs
+++ replace is_use_dpop_nonce_error -> bool with true
@@ -1029,17 +1029,17 @@
         .and_then(|j| j.get("error_description"))
         .and_then(|d| d.as_str())
         .map(ToString::to_string);
     (error_code, error_desc)
 }
 
 /// Checks whether a parsed JSON body is a `use_dpop_nonce` DPoP challenge.
 fn is_use_dpop_nonce_error(json: Option<&serde_json::Value>) -> bool {
-    json.and_then(|j| j.get("error")).and_then(|e| e.as_str()) == Some("use_dpop_nonce")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads a bounded body and parses it as lenient JSON, returning `None` on non-JSON bodies.
 async fn read_bounded_json(
     resp: reqwest::Response,
 ) -> Result<Option<serde_json::Value>, TokenError> {
     let bytes = read_bounded_body(resp, MAX_OAUTH_RESPONSE_BYTES)
         .await
