--- src/crypto.rs
+++ replace != with == in sign_p256_raw
@@ -139,17 +139,17 @@
 /// This format is mandated by RFC 7518 § 3.4 for the `ES256` algorithm.
 ///
 /// # Errors
 ///
 /// Returns [`CryptoError::EcdsaSign`] if signature creation fails.
 pub fn sign_p256_raw(signing_key: &SigningKey, message: &[u8]) -> Result<[u8; 64], CryptoError> {
     let sig: Signature = signing_key.sign(message);
     let bytes = sig.to_bytes();
-    if bytes.len() != 64 {
+    if bytes.len() == /* ~ changed by cargo-mutants ~ */ 64 {
         return Err(CryptoError::EcdsaSign(format!(
             "Signature generated unexpected length {}, expected 64",
             bytes.len()
         )));
     }
     let mut out = [0u8; 64];
     out.copy_from_slice(&bytes);
     Ok(out)
