--- src/client.rs
+++ replace read_bounded_json -> Result<Option<serde_json::Value>, TokenError> with Ok(Some(Default::default()))
@@ -1036,20 +1036,17 @@
 fn is_use_dpop_nonce_error(json: Option<&serde_json::Value>) -> bool {
     json.and_then(|j| j.get("error")).and_then(|e| e.as_str()) == Some("use_dpop_nonce")
 }
 
 /// Reads a bounded body and parses it as lenient JSON, returning `None` on non-JSON bodies.
 async fn read_bounded_json(
     resp: reqwest::Response,
 ) -> Result<Option<serde_json::Value>, TokenError> {
-    let bytes = read_bounded_body(resp, MAX_OAUTH_RESPONSE_BYTES)
-        .await
-        .map_err(|e| TokenError::Http(e.to_string()))?;
-    Ok(serde_json::from_slice(&bytes).ok())
+    Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Free-function core for DPoP-bound token endpoint requests with transparent
 /// auto-nonce retry, shared by code exchange and session refresh.
 ///
 /// Redirects are rejected per RFC 6749; a single retry is performed when the
 /// server responds with a `use_dpop_nonce` challenge.
 async fn send_dpop_token_request_inner(
