--- src/crypto.rs
+++ replace verifying_key_from_coordinates -> Result<VerifyingKey, CryptoError> with Ok(Default::default())
@@ -185,23 +185,17 @@
 ///
 /// # Errors
 ///
 /// Returns [`CryptoError::InvalidPoint`] if the coordinates do not lie on the curve.
 pub fn verifying_key_from_coordinates(
     x_bytes: &[u8; 32],
     y_bytes: &[u8; 32],
 ) -> Result<VerifyingKey, CryptoError> {
-    let mut sec1 = [0u8; 65];
-    sec1[0] = 0x04; // Uncompressed indicator
-    sec1[1..33].copy_from_slice(x_bytes);
-    sec1[33..65].copy_from_slice(y_bytes);
-
-    VerifyingKey::from_sec1_bytes(&sec1)
-        .map_err(|e| CryptoError::InvalidPoint(format!("Invalid P-256 public key point: {e}")))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extracts uncompressed affine coordinates (x, y) as 32-byte arrays from a [`VerifyingKey`].
 #[must_use]
 pub fn verifying_key_to_coordinates(verifying_key: &VerifyingKey) -> ([u8; 32], [u8; 32]) {
     let encoded = verifying_key.to_encoded_point(false);
     let mut x_out = [0u8; 32];
     let mut y_out = [0u8; 32];
