--- src/client.rs
+++ replace send_dpop_token_request_inner -> Result<TokenResponse, AtprotoOAuthError> with Ok(Default::default())
@@ -1054,171 +1054,17 @@
 /// server responds with a `use_dpop_nonce` challenge.
 async fn send_dpop_token_request_inner(
     ssrf_filter: &SsrfFilter,
     nonce_cache: &DPoPNonceCache,
     token_endpoint: &str,
     dpop_key: &DPoPKey,
     body_bytes: Vec<u8>,
 ) -> Result<TokenResponse, AtprotoOAuthError> {
-    let parsed_url = Url::parse(token_endpoint).map_err(|e| {
-        TokenError::Http(format!(
-            "Invalid token endpoint URL '{token_endpoint}': {e}"
-        ))
-    })?;
-
-    let (client, _pinned_addr, host_header) = ssrf_filter
-        .build_pinned_client(&parsed_url)
-        .await
-        .map_err(TokenError::from)?;
-
-    let server_origin = parsed_url.origin().ascii_serialization();
-
-    // Initial Attempt with cached nonce (if any)
-    let initial_nonce = nonce_cache.get_nonce(&server_origin);
-    let proof = dpop_key.create_proof("POST", token_endpoint, initial_nonce.as_deref(), None)?;
-
-    let resp = client
-        .post(token_endpoint)
-        .header(reqwest::header::HOST, host_header.clone())
-        .header("content-type", "application/x-www-form-urlencoded")
-        .header("accept", "application/json")
-        .header("dpop", proof)
-        .body(body_bytes.clone())
-        .send()
-        .await
-        .map_err(|e| TokenError::Http(e.to_string()))?;
-
-    // Cache any returned DPoP-Nonce header
-    if let Some(new_nonce) = extract_dpop_nonce(
-        resp.headers()
-            .get("dpop-nonce")
-            .and_then(|h| h.to_str().ok()),
-    ) {
-        nonce_cache.set_nonce(&server_origin, new_nonce);
-    }
-
-    let status = resp.status();
-
-    // Disallow redirects on token endpoints (RFC 6749)
-    if status.is_redirection() {
-        return Err(TokenError::RequestFailed {
-            status: status.as_u16(),
-            error: "invalid_request".to_string(),
-            description: Some("Redirects are not permitted for token endpoints".to_string()),
-        }
-        .into());
-    }
-
-    // Check for use_dpop_nonce error challenge
-    if status == reqwest::StatusCode::BAD_REQUEST || status == reqwest::StatusCode::UNAUTHORIZED {
-        let json_err = read_bounded_json(resp).await?;
-        if is_use_dpop_nonce_error(json_err.as_ref()) {
-            let fresh_nonce =
-                nonce_cache
-                    .get_nonce(&server_origin)
-                    .ok_or_else(|| TokenError::RequestFailed {
-                        status: status.as_u16(),
-                        error: "use_dpop_nonce".to_string(),
-                        description: Some(
-                            "Missing DPoP-Nonce header in challenge response".to_string(),
-                        ),
-                    })?;
-
-            // Single Retry with fresh nonce
-            let retry_proof =
-                dpop_key.create_proof("POST", token_endpoint, Some(&fresh_nonce), None)?;
-
-            let (retry_client, _retry_pinned_addr, retry_host_header) = ssrf_filter
-                .build_pinned_client(&parsed_url)
-                .await
-                .map_err(TokenError::from)?;
-
-            let retry_resp = retry_client
-                .post(token_endpoint)
-                .header(reqwest::header::HOST, retry_host_header)
-                .header("content-type", "application/x-www-form-urlencoded")
-                .header("accept", "application/json")
-                .header("dpop", retry_proof)
-                .body(body_bytes)
-                .send()
-                .await
-                .map_err(|e| TokenError::Http(e.to_string()))?;
-
-            if let Some(new_nonce) = extract_dpop_nonce(
-                retry_resp
-                    .headers()
-                    .get("dpop-nonce")
-                    .and_then(|h| h.to_str().ok()),
-            ) {
-                nonce_cache.set_nonce(&server_origin, new_nonce);
-            }
-
-            let retry_status = retry_resp.status();
-
-            if retry_status.is_redirection() {
-                return Err(TokenError::RequestFailed {
-                    status: retry_status.as_u16(),
-                    error: "invalid_request".to_string(),
-                    description: Some(
-                        "Redirects are not permitted for token endpoints".to_string(),
-                    ),
-                }
-                .into());
-            }
-
-            if retry_status.is_success() {
-                let bytes = read_bounded_body(retry_resp, MAX_OAUTH_RESPONSE_BYTES)
-                    .await
-                    .map_err(|e| TokenError::Http(e.to_string()))?;
-                let res: TokenResponse =
-                    serde_json::from_slice(&bytes).map_err(|e| TokenError::Json(e.to_string()))?;
-                return Ok(res);
-            }
-
-            let err_json = read_bounded_json(retry_resp).await?;
-            if is_use_dpop_nonce_error(err_json.as_ref()) {
-                return Err(DPoPError::NonceRetryLimitExceeded.into());
-            }
-
-            let (error_code, error_desc) = parse_oauth_error_fields(err_json.as_ref());
-            return Err(TokenError::RequestFailed {
-                status: retry_status.as_u16(),
-                error: error_code,
-                description: error_desc,
-            }
-            .into());
-        }
-
-        let (error_code, error_desc) = parse_oauth_error_fields(json_err.as_ref());
-        return Err(TokenError::RequestFailed {
-            status: status.as_u16(),
-            error: error_code,
-            description: error_desc,
-        }
-        .into());
-    }
-
-    if !status.is_success() {
-        let err_json = read_bounded_json(resp).await?;
-        let (error_code, error_desc) = parse_oauth_error_fields(err_json.as_ref());
-        return Err(TokenError::RequestFailed {
-            status: status.as_u16(),
-            error: error_code,
-            description: error_desc,
-        }
-        .into());
-    }
-
-    let bytes = read_bounded_body(resp, MAX_OAUTH_RESPONSE_BYTES)
-        .await
-        .map_err(|e| TokenError::Http(e.to_string()))?;
-    let res: TokenResponse =
-        serde_json::from_slice(&bytes).map_err(|e| TokenError::Json(e.to_string()))?;
-    Ok(res)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic, missing_docs)]
 mod tests {
     use super::*;
 
     #[test]
