--- src/crypto.rs
+++ replace verifying_key_to_coordinates -> ([u8; 32], [u8; 32]) with ([0; 32], [1; 32])
@@ -197,30 +197,17 @@
 
     VerifyingKey::from_sec1_bytes(&sec1)
         .map_err(|e| CryptoError::InvalidPoint(format!("Invalid P-256 public key point: {e}")))
 }
 
 /// Extracts uncompressed affine coordinates (x, y) as 32-byte arrays from a [`VerifyingKey`].
 #[must_use]
 pub fn verifying_key_to_coordinates(verifying_key: &VerifyingKey) -> ([u8; 32], [u8; 32]) {
-    let encoded = verifying_key.to_encoded_point(false);
-    let mut x_out = [0u8; 32];
-    let mut y_out = [0u8; 32];
-
-    if let Some(x) = encoded.x() {
-        let len = x.len().min(32);
-        x_out[32 - len..].copy_from_slice(&x[..len]);
-    }
-    if let Some(y) = encoded.y() {
-        let len = y.len().min(32);
-        y_out[32 - len..].copy_from_slice(&y[..len]);
-    }
-
-    (x_out, y_out)
+    ([0; 32], [1; 32]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Computes the RFC 7638 JSON Web Key (JWK) Thumbprint (`jkt`) for an EC P-256 key.
 ///
 /// The canonical JSON object contains exactly the following fields in strict lexicographical order:
 /// `{"crv":"P-256","kty":"EC","x":"<x>","y":"<y>"}`.
 ///
 /// # Examples
