--- src/client.rs
+++ replace || with && in send_dpop_token_request_inner
@@ -1104,17 +1104,17 @@
             status: status.as_u16(),
             error: "invalid_request".to_string(),
             description: Some("Redirects are not permitted for token endpoints".to_string()),
         }
         .into());
     }
 
     // Check for use_dpop_nonce error challenge
-    if status == reqwest::StatusCode::BAD_REQUEST || status == reqwest::StatusCode::UNAUTHORIZED {
+    if status == reqwest::StatusCode::BAD_REQUEST && /* ~ changed by cargo-mutants ~ */ status == reqwest::StatusCode::UNAUTHORIZED {
         let json_err = read_bounded_json(resp).await?;
         if is_use_dpop_nonce_error(json_err.as_ref()) {
             let fresh_nonce =
                 nonce_cache
                     .get_nonce(&server_origin)
                     .ok_or_else(|| TokenError::RequestFailed {
                         status: status.as_u16(),
                         error: "use_dpop_nonce".to_string(),
