--- src/crypto.rs
+++ replace - with + in verifying_key_to_coordinates
@@ -203,17 +203,17 @@
 #[must_use]
 pub fn verifying_key_to_coordinates(verifying_key: &VerifyingKey) -> ([u8; 32], [u8; 32]) {
     let encoded = verifying_key.to_encoded_point(false);
     let mut x_out = [0u8; 32];
     let mut y_out = [0u8; 32];
 
     if let Some(x) = encoded.x() {
         let len = x.len().min(32);
-        x_out[32 - len..].copy_from_slice(&x[..len]);
+        x_out[32 + /* ~ changed by cargo-mutants ~ */ len..].copy_from_slice(&x[..len]);
     }
     if let Some(y) = encoded.y() {
         let len = y.len().min(32);
         y_out[32 - len..].copy_from_slice(&y[..len]);
     }
 
     (x_out, y_out)
 }
