--- src/client.rs
+++ replace <impl std::fmt::Debug for StoredStateEntry>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -126,31 +126,17 @@
     /// Timestamp when this state entry was created.
     pub created_at: SystemTime,
     /// State validity duration in seconds (defaults to 300s).
     pub expires_in_secs: u64,
 }
 
 impl std::fmt::Debug for StoredStateEntry {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.debug_struct("StoredStateEntry")
-            .field("state", &self.state)
-            .field("client_id", &self.client_id)
-            .field("code_verifier", &"[REDACTED]")
-            .field("dpop_key", &self.dpop_key)
-            .field("issuer", &self.issuer)
-            .field("did", &self.did)
-            .field("handle", &self.handle)
-            .field("redirect_uri", &self.redirect_uri)
-            .field("pds_endpoint", &self.pds_endpoint)
-            .field("token_endpoint", &self.token_endpoint)
-            .field("scopes", &self.scopes)
-            .field("created_at", &self.created_at)
-            .field("expires_in_secs", &self.expires_in_secs)
-            .finish()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Zeroize for StoredStateEntry {
     fn zeroize(&mut self) {
         self.code_verifier.zeroize();
     }
 }
