--- src/client.rs
+++ replace <impl Zeroize for StoredStateEntry>::zeroize with ()
@@ -146,17 +146,17 @@
             .field("created_at", &self.created_at)
             .field("expires_in_secs", &self.expires_in_secs)
             .finish()
     }
 }
 
 impl Zeroize for StoredStateEntry {
     fn zeroize(&mut self) {
-        self.code_verifier.zeroize();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Drop for StoredStateEntry {
     fn drop(&mut self) {
         self.zeroize();
     }
 }
