--- src/client.rs
+++ replace <impl Drop for StoredStateEntry>::drop with ()
@@ -152,17 +152,17 @@
 impl Zeroize for StoredStateEntry {
     fn zeroize(&mut self) {
         self.code_verifier.zeroize();
     }
 }
 
 impl Drop for StoredStateEntry {
     fn drop(&mut self) {
-        self.zeroize();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ZeroizeOnDrop for StoredStateEntry {}
 
 impl StoredStateEntry {
     /// Checks whether this stored state entry has expired.
     ///
