--- src/crypto.rs
+++ replace jwk_thumbprint_rsa -> String with String::new()
@@ -254,19 +254,17 @@
 /// let jkt = jwk_thumbprint_rsa(
 ///     "AQAB",
 ///     "0vx7agoebGcQSuuPiLJXZptN9nndrQmbXEps2aiAFbWhM78LhWx4cbbfAAtVT86zwu1RK7aPFFxuhDR1L6tSoc_BJECPebWKRXjBZCiFV4n3oknjhMstn64tZ_2W-5JsGY4Hc5n9yBXArwl93lqt7_RN5w6Cf0h4QyQ5v-65YGjQR0_FDW2QvzqY368QQMicAtaSqzs8KJZgnYb9c7d0zgdAZHzu6qMQvRL5hajrn1n91CbOpbISD08qNLyrdkt-bFTWhAI4vMQFh6WeZu0fM4lFd2NcRwr3XPksINHaQ-G_xBniIqbw0Ls1jF44-csFCur-kEgU8awapJzKnqDKgw",
 /// );
 /// assert_eq!(jkt, "NzbLsXh8uDCcd-6MNwXF4W_7noWXFZAfHkxZsRGC9Xs");
 /// ```
 #[must_use]
 pub fn jwk_thumbprint_rsa(e: &str, n: &str) -> String {
-    let canonical_json = format!(r#"{{"e":"{e}","kty":"RSA","n":"{n}"}}"#);
-    let digest = sha256_digest(canonical_json.as_bytes());
-    base64url_encode(&digest)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic, missing_docs)]
 mod tests {
     use super::*;
 
     #[test]
