--- src/client.rs
+++ replace > with == in StoredStateEntry::is_expired
@@ -169,17 +169,17 @@
     /// Fails closed: if the system clock is earlier than `created_at` (backward
     /// step / NTP correction), the entry is treated as expired rather than valid.
     #[must_use]
     pub fn is_expired(&self) -> bool {
         let now = SystemTime::now();
         let max_age = Duration::from_secs(self.expires_in_secs);
         match now.duration_since(self.created_at) {
             // Normal path: elapsed time exceeds the configured maximum age.
-            Ok(elapsed) => elapsed > max_age,
+            Ok(elapsed) => elapsed == /* ~ changed by cargo-mutants ~ */ max_age,
             // Clock moved backward below `created_at`: fail closed.
             Err(_) => true,
         }
     }
 }
 
 /// The result of initiating an OAuth authorization flow.
 #[derive(Debug, Clone)]
