--- src/crypto.rs
+++ replace constant_time_eq -> bool with false
@@ -24,20 +24,17 @@
 /// ```
 /// use skyauth::crypto::constant_time_eq;
 ///
 /// assert!(constant_time_eq(b"secret_token", b"secret_token"));
 /// assert!(!constant_time_eq(b"secret_token", b"wrong_token_"));
 /// ```
 #[must_use]
 pub fn constant_time_eq(a: &[u8], b: &[u8]) -> bool {
-    if a.len() != b.len() {
-        return false;
-    }
-    a.ct_eq(b).into()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Computes the 256-bit SHA-256 cryptographic digest of arbitrary input data.
 ///
 /// # Examples
 ///
 /// ```
 /// use skyauth::crypto::sha256_digest;
