--- src/client.rs
+++ replace CallbackParams::with_iss -> Self with Default::default()
@@ -216,18 +216,17 @@
             state: state.into(),
             iss: None,
         }
     }
 
     /// Sets the optional RFC 9207 `iss` issuer parameter.
     #[must_use]
     pub fn with_iss(mut self, iss: impl Into<String>) -> Self {
-        self.iss = Some(iss.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Raw parsed token endpoint response representation.
 #[derive(Debug, Clone, PartialEq, Eq, serde::Deserialize, serde::Serialize)]
 pub struct TokenResponse {
     /// Access token string.
     pub access_token: String,
