--- src/client.rs
+++ replace AtprotoOAuthClientBuilder::nonce_cache -> Self with Default::default()
@@ -295,18 +295,17 @@
     pub fn identity_resolver(mut self, resolver: IdentityResolver) -> Self {
         self.resolver = Some(resolver);
         self
     }
 
     /// Sets the shared DPoP nonce cache.
     #[must_use]
     pub fn nonce_cache(mut self, cache: DPoPNonceCache) -> Self {
-        self.nonce_cache = Some(cache);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets the SSRF filter configuration.
     #[must_use]
     pub fn ssrf_filter(mut self, filter: SsrfFilter) -> Self {
         self.ssrf_filter = filter;
         self
     }
