--- src/client.rs
+++ replace AtprotoOAuthClientBuilder::ssrf_filter -> Self with Default::default()
@@ -302,18 +302,17 @@
     pub fn nonce_cache(mut self, cache: DPoPNonceCache) -> Self {
         self.nonce_cache = Some(cache);
         self
     }
 
     /// Sets the SSRF filter configuration.
     #[must_use]
     pub fn ssrf_filter(mut self, filter: SsrfFilter) -> Self {
-        self.ssrf_filter = filter;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Configures whether insecure HTTP and localhost connections are permitted (for test environments).
     #[must_use]
     pub fn allow_insecure_localhost(mut self, allow: bool) -> Self {
         self.ssrf_filter.allow_insecure_localhost = allow;
         self
     }
