--- src/client.rs
+++ replace AtprotoOAuthClientBuilder::state_ttl -> Self with Default::default()
@@ -323,18 +323,17 @@
     pub fn state_store(mut self, store: Arc<OAuthStateStore>) -> Self {
         self.state_store = Some(store);
         self
     }
 
     /// Sets the TTL duration for authorization state entries.
     #[must_use]
     pub fn state_ttl(mut self, ttl: Duration) -> Self {
-        self.state_ttl = ttl;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Builds the configured [`AtprotoOAuthClient`].
     ///
     /// # Panics / Errors
     ///
     /// Returns error if client metadata is missing.
     pub fn build(self) -> Result<AtprotoOAuthClient, AtprotoOAuthError> {
