--- src/client.rs
+++ replace AtprotoOAuthClient::builder -> AtprotoOAuthClientBuilder with Default::default()
@@ -396,17 +396,17 @@
             state_store: Arc::new(OAuthStateStore::default()),
             state_ttl: DEFAULT_STATE_TTL,
         }
     }
 
     /// Creates a builder for custom client construction.
     #[must_use]
     pub fn builder() -> AtprotoOAuthClientBuilder {
-        AtprotoOAuthClientBuilder::new()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the configured client metadata.
     #[must_use]
     pub const fn metadata(&self) -> &OAuthClientMetadata {
         &self.metadata
     }
 
