--- src/client.rs
+++ replace AtprotoOAuthClient::metadata -> &OAuthClientMetadata with Box::leak(Box::new(Default::default()))
@@ -402,17 +402,17 @@
     #[must_use]
     pub fn builder() -> AtprotoOAuthClientBuilder {
         AtprotoOAuthClientBuilder::new()
     }
 
     /// Returns a reference to the configured client metadata.
     #[must_use]
     pub const fn metadata(&self) -> &OAuthClientMetadata {
-        &self.metadata
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the internal identity resolver.
     #[must_use]
     pub const fn resolver(&self) -> &IdentityResolver {
         &self.resolver
     }
 
