--- src/client.rs
+++ replace <impl std::fmt::Debug for OAuthClientMetadata>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -36,26 +36,17 @@
     /// Optional human-readable client display name.
     pub client_name: Option<String>,
     /// Optional client secret for confidential client authentication.
     pub client_secret: Option<String>,
 }
 
 impl std::fmt::Debug for OAuthClientMetadata {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.debug_struct("OAuthClientMetadata")
-            .field("client_id", &self.client_id)
-            .field("redirect_uri", &self.redirect_uri)
-            .field("scope", &self.scope)
-            .field("client_name", &self.client_name)
-            .field(
-                "client_secret",
-                &self.client_secret.as_ref().map(|_| "[REDACTED]"),
-            )
-            .finish()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl OAuthClientMetadata {
     /// Creates a new `OAuthClientMetadata` with default scope `"atproto"`.
     #[must_use]
     pub fn new(client_id: impl Into<String>, redirect_uri: impl Into<String>) -> Self {
         Self {
