--- src/client.rs
+++ replace AtprotoOAuthClient::ssrf_filter -> &SsrfFilter with Box::leak(Box::new(Default::default()))
@@ -420,17 +420,17 @@
     #[must_use]
     pub const fn nonce_cache(&self) -> &DPoPNonceCache {
         &self.nonce_cache
     }
 
     /// Returns a reference to the active SSRF filter.
     #[must_use]
     pub const fn ssrf_filter(&self) -> &SsrfFilter {
-        &self.ssrf_filter
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the internal OAuth state store.
     #[must_use]
     pub fn state_store(&self) -> &Arc<OAuthStateStore> {
         &self.state_store
     }
 
