--- src/client.rs
+++ replace AtprotoOAuthClient::state_ttl -> Duration with Default::default()
@@ -432,17 +432,17 @@
     #[must_use]
     pub fn state_store(&self) -> &Arc<OAuthStateStore> {
         &self.state_store
     }
 
     /// Returns the configured state TTL duration.
     #[must_use]
     pub const fn state_ttl(&self) -> Duration {
-        self.state_ttl
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Initiates an OAuth authorization flow for a user handle or DID and returns the [`AuthorizationRequest`].
     ///
     /// The authorization state entry is automatically registered into the client's internal
     /// state store for atomic, single-use callback verification via [`Self::handle_callback`].
     ///
     /// # Errors
