--- src/client.rs
+++ replace AtprotoOAuthClient::authorize -> Result<AuthorizationRequest, AtprotoOAuthError> with Ok(Default::default())
@@ -447,18 +447,17 @@
     ///
     /// # Errors
     ///
     /// Returns [`AtprotoOAuthError`] if identity resolution, PAR, or cryptographic operations fail.
     pub async fn authorize(
         &self,
         handle_or_did: &str,
     ) -> Result<AuthorizationRequest, AtprotoOAuthError> {
-        let (req, _) = self.initiate_login(handle_or_did).await?;
-        Ok(req)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Initiates an OAuth login flow for a user handle or DID.
     ///
     /// # Pipeline
     /// 1. Discovers identity, PDS endpoint, and authorization server metadata.
     /// 2. Generates a fresh S256 PKCE code challenge and verifier.
     /// 3. Generates a high-entropy 256-bit random state token.
