--- src/client.rs
+++ delete ! in AtprotoOAuthClient::exchange_code
@@ -615,17 +615,17 @@
             .send_dpop_token_request(
                 &state_entry.token_endpoint,
                 &state_entry.dpop_key,
                 form_body.into_bytes(),
             )
             .await?;
 
         // 1. Validate token_type == "DPoP" (case-insensitive)
-        if !resp_json.token_type.eq_ignore_ascii_case("DPoP") {
+        if  /* ~ changed by cargo-mutants ~ */resp_json.token_type.eq_ignore_ascii_case("DPoP") {
             return Err(TokenError::InvalidTokenType(resp_json.token_type).into());
         }
 
         // 2. Validate sub DID
         if resp_json.sub.trim().is_empty() {
             return Err(TokenError::MissingDid.into());
         }
         if let Some(ref expected_did) = state_entry.did {
