--- src/client.rs
+++ replace != with == in AtprotoOAuthClient::exchange_code
@@ -624,17 +624,17 @@
             return Err(TokenError::InvalidTokenType(resp_json.token_type).into());
         }
 
         // 2. Validate sub DID
         if resp_json.sub.trim().is_empty() {
             return Err(TokenError::MissingDid.into());
         }
         if let Some(ref expected_did) = state_entry.did {
-            if &resp_json.sub != expected_did {
+            if &resp_json.sub == /* ~ changed by cargo-mutants ~ */ expected_did {
                 return Err(TokenError::SubMismatch {
                     expected: expected_did.clone(),
                     actual: resp_json.sub.clone(),
                 }
                 .into());
             }
         }
 
