--- src/client.rs
+++ replace AtprotoOAuthClient::initiate_login_with_scope -> Result<(AuthorizationRequest, StoredStateEntry), AtprotoOAuthError> with Ok((Default::default(), Default::default()))
@@ -481,105 +481,17 @@
 
     /// Initiates an OAuth login flow with custom scope overrides.
     pub async fn initiate_login_with_scope(
         &self,
         handle_or_did: &str,
         scope: &str,
     ) -> Result<(AuthorizationRequest, StoredStateEntry), AtprotoOAuthError> {
         // 1. Identity & OAuth Discovery
-        let endpoints = self
-            .resolver
-            .discover_oauth_endpoints(handle_or_did)
-            .await?;
-
-        // 2. PKCE and State Generation
-        let pkce = PkcePair::generate();
-        let mut state_bytes = [0u8; 32];
-        rand::RngCore::fill_bytes(&mut rand::thread_rng(), &mut state_bytes);
-        let state = base64url_encode(&state_bytes);
-
-        // 3. Ephemeral DPoP Keypair
-        let dpop_key = DPoPKey::generate();
-
-        // 4. PAR Request Builder
-        let mut params = ParParameters::new(
-            &self.metadata.client_id,
-            &self.metadata.redirect_uri,
-            scope,
-            &state,
-            &pkce.challenge,
-        );
-
-        if let Some(ref handle) = endpoints.handle {
-            params = params.with_login_hint(handle);
-        } else {
-            params = params.with_login_hint(&endpoints.did);
-        }
-
-        // 5. Execute PAR with DPoP signing & auto-nonce retry
-        let par_res = if let Some(ref secret) = self.metadata.client_secret {
-            execute_par_request_with_credentials(
-                &self.ssrf_filter,
-                &endpoints.par_endpoint,
-                &params,
-                &dpop_key,
-                &self.nonce_cache,
-                &[("client_secret", secret.as_str())],
-            )
-            .await?
-        } else {
-            execute_par_request(
-                &self.ssrf_filter,
-                &endpoints.par_endpoint,
-                &params,
-                &dpop_key,
-                &self.nonce_cache,
-            )
-            .await?
-        };
-
-        // 6. Build Authorization Redirect URL
-        let auth_url = build_authorization_url(
-            &endpoints.authorization_endpoint,
-            &self.metadata.client_id,
-            &par_res.request_uri,
-        )?;
-
-        // 7. Assemble StoredStateEntry and AuthorizationRequest
-        let stored_state = StoredStateEntry {
-            state: state.clone(),
-            client_id: self.metadata.client_id.clone(),
-            code_verifier: pkce.verifier,
-            dpop_key,
-            issuer: endpoints.auth_server_issuer.clone(),
-            did: Some(endpoints.did),
-            handle: endpoints.handle,
-            redirect_uri: self.metadata.redirect_uri.clone(),
-            pds_endpoint: endpoints.pds_endpoint,
-            token_endpoint: endpoints.token_endpoint,
-            scopes: scope.to_string(),
-            created_at: SystemTime::now(),
-            expires_in_secs: self.state_ttl.as_secs(),
-        };
-
-        // 8. Atomically persist state into internal store with TTL
-        self.state_store
-            .insert_state(state.clone(), stored_state.clone(), self.state_ttl)
-            .await?;
-
-        let auth_req = AuthorizationRequest {
-            authorization_url: auth_url,
-            state: state.clone(),
-            request_uri: par_res.request_uri,
-            expires_in: par_res.expires_in,
-            stored_state: stored_state.clone(),
-        };
-
-        Ok((auth_req, stored_state))
+        Ok((Default::default(), Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Exchanges an authorization code for an authenticated [`OAuthSession`].
     ///
     /// # Checks Performed
     /// 1. Dispatches POST request to `state_entry.token_endpoint` with `grant_type=authorization_code`.
     /// 2. Signs DPoP proof with `state_entry.dpop_key` for `POST <token_endpoint>`.
     /// 3. Transparently handles `use_dpop_nonce` error challenge with automated single-retry loop.
