--- src/client.rs
+++ replace AtprotoOAuthClient::exchange_code -> Result<OAuthSession, AtprotoOAuthError> with Ok(Default::default())
@@ -590,79 +590,17 @@
     /// # Errors
     ///
     /// Returns [`AtprotoOAuthError`] if token endpoint exchange or validation fails.
     pub async fn exchange_code(
         &self,
         code: &str,
         state_entry: &StoredStateEntry,
     ) -> Result<OAuthSession, AtprotoOAuthError> {
-        let mut form_pairs: Vec<(&str, &str)> = vec![
-            ("grant_type", "authorization_code"),
-            ("code", code),
-            ("redirect_uri", state_entry.redirect_uri.as_str()),
-            ("client_id", state_entry.client_id.as_str()),
-            ("code_verifier", state_entry.code_verifier.as_str()),
-        ];
-
-        // Confidential-client authentication (RFC 6749 § 2.3.1, client_secret_post)
-        if let Some(ref secret) = self.metadata.client_secret {
-            form_pairs.push(("client_secret", secret.as_str()));
-        }
-
-        let form_body =
-            serde_urlencoded::to_string(form_pairs).map_err(|e| TokenError::Http(e.to_string()))?;
-
-        let resp_json: TokenResponse = self
-            .send_dpop_token_request(
-                &state_entry.token_endpoint,
-                &state_entry.dpop_key,
-                form_body.into_bytes(),
-            )
-            .await?;
-
-        // 1. Validate token_type == "DPoP" (case-insensitive)
-        if !resp_json.token_type.eq_ignore_ascii_case("DPoP") {
-            return Err(TokenError::InvalidTokenType(resp_json.token_type).into());
-        }
-
-        // 2. Validate sub DID
-        if resp_json.sub.trim().is_empty() {
-            return Err(TokenError::MissingDid.into());
-        }
-        if let Some(ref expected_did) = state_entry.did {
-            if &resp_json.sub != expected_did {
-                return Err(TokenError::SubMismatch {
-                    expected: expected_did.clone(),
-                    actual: resp_json.sub.clone(),
-                }
-                .into());
-            }
-        }
-
-        // 3. Validate Scope is present and contains "atproto"
-        let scope_str = resp_json.scope.as_deref().ok_or(TokenError::MissingScope)?;
-
-        let has_atproto = scope_str.split_whitespace().any(|s| s == "atproto");
-        if !has_atproto {
-            return Err(TokenError::MissingAtprotoScope(scope_str.to_string()).into());
-        }
-
-        OAuthSession::new(
-            resp_json.sub,
-            resp_json.access_token,
-            resp_json.refresh_token,
-            resp_json.token_type,
-            resp_json.scope,
-            resp_json.expires_in,
-            state_entry.dpop_key.clone(),
-            Some(state_entry.pds_endpoint.clone()),
-            Some(state_entry.issuer.clone()),
-            Some(state_entry.token_endpoint.clone()),
-        )
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Handles an OAuth redirect callback by atomically consuming the stored state from the
     /// internal [`OAuthStateStore`], verifying expiration and RFC 9207 `iss`, and exchanging the code.
     ///
     /// # Single-Use Guarantee
     /// The state token is atomically consumed from storage on first attempt. Replaying the callback
     /// or presenting an expired state will immediately return an error.
