--- src/client.rs
+++ delete ! in AtprotoOAuthClient::exchange_code
@@ -637,17 +637,17 @@
                 .into());
             }
         }
 
         // 3. Validate Scope is present and contains "atproto"
         let scope_str = resp_json.scope.as_deref().ok_or(TokenError::MissingScope)?;
 
         let has_atproto = scope_str.split_whitespace().any(|s| s == "atproto");
-        if !has_atproto {
+        if  /* ~ changed by cargo-mutants ~ */has_atproto {
             return Err(TokenError::MissingAtprotoScope(scope_str.to_string()).into());
         }
 
         OAuthSession::new(
             resp_json.sub,
             resp_json.access_token,
             resp_json.refresh_token,
             resp_json.token_type,
