--- src/client.rs
+++ replace AtprotoOAuthClient::handle_callback -> Result<OAuthSession, AtprotoOAuthError> with Ok(Default::default())
@@ -671,29 +671,17 @@
     /// - Returns [`TokenError::InvalidState`] if the state token is not found, has expired, or was already consumed.
     /// - Returns [`TokenError::StateExpired`] if the stored state entry has expired.
     /// - Returns [`TokenError::MissingCallbackIssuer`] if callback `iss` is missing.
     /// - Returns [`TokenError::IssuerMismatch`] if callback `iss` does not match the stored issuer.
     pub async fn handle_callback(
         &self,
         callback_params: &CallbackParams,
     ) -> Result<OAuthSession, AtprotoOAuthError> {
-        let state_entry = self
-            .state_store
-            .take_state(&callback_params.state)
-            .await?
-            .ok_or_else(|| {
-                TokenError::InvalidState(format!(
-                    "State token '{}' not found, expired, or already consumed",
-                    callback_params.state
-                ))
-            })?;
-
-        self.handle_callback_with_entry(callback_params, &state_entry)
-            .await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Handles an OAuth redirect callback with an explicitly provided [`StoredStateEntry`],
     /// enforcing expiration and RFC 9207 `iss` verification before code exchange.
     ///
     /// # Errors
     /// - Returns [`TokenError::InvalidState`] if `callback_params.state` does not match `state_entry.state`.
     /// - Returns [`TokenError::StateExpired`] if `state_entry` has expired.
