--- src/client.rs
+++ replace != with == in AtprotoOAuthClient::handle_callback_with_entry
@@ -699,17 +699,17 @@
     /// - Returns [`TokenError::StateExpired`] if `state_entry` has expired.
     /// - Returns [`TokenError::MissingCallbackIssuer`] if callback `iss` is missing.
     /// - Returns [`TokenError::IssuerMismatch`] if callback `iss` does not match `state_entry.issuer`.
     pub async fn handle_callback_with_entry(
         &self,
         callback_params: &CallbackParams,
         state_entry: &StoredStateEntry,
     ) -> Result<OAuthSession, AtprotoOAuthError> {
-        if callback_params.state != state_entry.state {
+        if callback_params.state == /* ~ changed by cargo-mutants ~ */ state_entry.state {
             return Err(TokenError::InvalidState(format!(
                 "Callback state '{}' does not match expected state '{}'",
                 callback_params.state, state_entry.state
             ))
             .into());
         }
 
         if state_entry.is_expired() {
