--- src/client.rs
+++ replace AtprotoOAuthClient::handle_callback_with_entry -> Result<OAuthSession, AtprotoOAuthError> with Ok(Default::default())
@@ -699,44 +699,17 @@
     /// - Returns [`TokenError::StateExpired`] if `state_entry` has expired.
     /// - Returns [`TokenError::MissingCallbackIssuer`] if callback `iss` is missing.
     /// - Returns [`TokenError::IssuerMismatch`] if callback `iss` does not match `state_entry.issuer`.
     pub async fn handle_callback_with_entry(
         &self,
         callback_params: &CallbackParams,
         state_entry: &StoredStateEntry,
     ) -> Result<OAuthSession, AtprotoOAuthError> {
-        if callback_params.state != state_entry.state {
-            return Err(TokenError::InvalidState(format!(
-                "Callback state '{}' does not match expected state '{}'",
-                callback_params.state, state_entry.state
-            ))
-            .into());
-        }
-
-        if state_entry.is_expired() {
-            return Err(TokenError::StateExpired.into());
-        }
-
-        let callback_iss = callback_params
-            .iss
-            .as_deref()
-            .ok_or(TokenError::MissingCallbackIssuer)?;
-
-        let norm_callback = callback_iss.trim().trim_end_matches('/');
-        let norm_expected = state_entry.issuer.trim().trim_end_matches('/');
-        if norm_callback != norm_expected {
-            return Err(TokenError::IssuerMismatch {
-                expected: state_entry.issuer.clone(),
-                actual: callback_iss.to_string(),
-            }
-            .into());
-        }
-
-        self.exchange_code(&callback_params.code, state_entry).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Refreshes an authenticated [`OAuthSession`] using its single-use refresh token.
     ///
     /// Atomically updates the session's access token, rotated refresh token, and expiration timestamp.
     ///
     /// # Errors
     /// - Returns [`TokenError::MissingRefreshToken`] if the session has no refresh token.
