--- src/client.rs
+++ replace OAuthClientMetadata::with_scope -> Self with Default::default()
@@ -65,18 +65,17 @@
             client_name: None,
             client_secret: None,
         }
     }
 
     /// Sets the requested OAuth scopes.
     #[must_use]
     pub fn with_scope(mut self, scope: impl Into<String>) -> Self {
-        self.scope = scope.into();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets the optional client display name.
     #[must_use]
     pub fn with_client_name(mut self, name: impl Into<String>) -> Self {
         self.client_name = Some(name.into());
         self
     }
