--- src/client.rs
+++ replace AtprotoOAuthClient::refresh_session -> Result<(), AtprotoOAuthError> with Ok(())
@@ -741,71 +741,17 @@
     /// # Errors
     /// - Returns [`TokenError::MissingRefreshToken`] if the session has no refresh token.
     /// - Returns [`TokenError::MissingField`] if the session has no token endpoint recorded.
     /// - Returns [`AtprotoOAuthError`] if token refresh or validation fails.
     pub async fn refresh_session(
         &self,
         session: &mut OAuthSession,
     ) -> Result<(), AtprotoOAuthError> {
-        let refresh_token = session
-            .refresh_token()
-            .ok_or(TokenError::MissingRefreshToken)?;
-
-        let token_endpoint = session
-            .token_endpoint()
-            .ok_or(TokenError::MissingField("token_endpoint"))?
-            .to_string();
-
-        let mut form_pairs: Vec<(&str, &str)> = vec![
-            ("grant_type", "refresh_token"),
-            ("refresh_token", refresh_token),
-            ("client_id", self.metadata.client_id.as_str()),
-        ];
-
-        // Confidential-client authentication (RFC 6749 § 2.3.1, client_secret_post)
-        if let Some(ref secret) = self.metadata.client_secret {
-            form_pairs.push(("client_secret", secret.as_str()));
-        }
-
-        let form_body =
-            serde_urlencoded::to_string(form_pairs).map_err(|e| TokenError::Http(e.to_string()))?;
-
-        let resp_json: TokenResponse = self
-            .send_dpop_token_request(&token_endpoint, session.dpop_key(), form_body.into_bytes())
-            .await?;
-
-        if !resp_json.token_type.eq_ignore_ascii_case("DPoP") {
-            return Err(TokenError::InvalidTokenType(resp_json.token_type).into());
-        }
-
-        if !resp_json.sub.is_empty() && resp_json.sub != session.sub() {
-            return Err(TokenError::SubMismatch {
-                expected: session.sub().to_string(),
-                actual: resp_json.sub,
-            }
-            .into());
-        }
-
-        // Scope revalidation: reject silent scope narrowing on rotation (RFC 6749 § 6:
-        // the refreshed scope MUST NOT exceed the original grant, and ATProto profiles
-        // mandate that "atproto" remains present).
-        if let Some(ref new_scope) = resp_json.scope {
-            if !new_scope.split_whitespace().any(|s| s == "atproto") {
-                return Err(TokenError::MissingAtprotoScope(new_scope.clone()).into());
-            }
-        }
-
-        session.rotate_tokens(
-            resp_json.access_token,
-            resp_json.refresh_token,
-            resp_json.expires_in,
-        );
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Refreshes a session and returns a new updated [`OAuthSession`] instance.
     pub async fn refresh_token(
         &self,
         session: &OAuthSession,
     ) -> Result<OAuthSession, AtprotoOAuthError> {
         let mut cloned = session.clone();
