--- src/client.rs
+++ delete ! in AtprotoOAuthClient::refresh_session
@@ -768,17 +768,17 @@
 
         let form_body =
             serde_urlencoded::to_string(form_pairs).map_err(|e| TokenError::Http(e.to_string()))?;
 
         let resp_json: TokenResponse = self
             .send_dpop_token_request(&token_endpoint, session.dpop_key(), form_body.into_bytes())
             .await?;
 
-        if !resp_json.token_type.eq_ignore_ascii_case("DPoP") {
+        if  /* ~ changed by cargo-mutants ~ */resp_json.token_type.eq_ignore_ascii_case("DPoP") {
             return Err(TokenError::InvalidTokenType(resp_json.token_type).into());
         }
 
         if !resp_json.sub.is_empty() && resp_json.sub != session.sub() {
             return Err(TokenError::SubMismatch {
                 expected: session.sub().to_string(),
                 actual: resp_json.sub,
             }
