--- src/client.rs
+++ replace OAuthClientMetadata::with_client_secret -> Self with Default::default()
@@ -79,18 +79,17 @@
     pub fn with_client_name(mut self, name: impl Into<String>) -> Self {
         self.client_name = Some(name.into());
         self
     }
 
     /// Sets the optional client secret.
     #[must_use]
     pub fn with_client_secret(mut self, secret: impl Into<String>) -> Self {
-        self.client_secret = Some(secret.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Stored authorization state entry for tracking an in-flight login transaction.
 ///
 /// Saved into the OAuth state store prior to user agent redirection, and consumed
 /// atomically upon callback receipt to guarantee single-use CSRF/replay protection.
 ///
