--- src/client.rs
+++ delete ! in AtprotoOAuthClient::refresh_session
@@ -772,17 +772,17 @@
         let resp_json: TokenResponse = self
             .send_dpop_token_request(&token_endpoint, session.dpop_key(), form_body.into_bytes())
             .await?;
 
         if !resp_json.token_type.eq_ignore_ascii_case("DPoP") {
             return Err(TokenError::InvalidTokenType(resp_json.token_type).into());
         }
 
-        if !resp_json.sub.is_empty() && resp_json.sub != session.sub() {
+        if  /* ~ changed by cargo-mutants ~ */resp_json.sub.is_empty() && resp_json.sub != session.sub() {
             return Err(TokenError::SubMismatch {
                 expected: session.sub().to_string(),
                 actual: resp_json.sub,
             }
             .into());
         }
 
         // Scope revalidation: reject silent scope narrowing on rotation (RFC 6749 § 6:
