--- src/client.rs
+++ replace == with != in AtprotoOAuthClient::refresh_session
@@ -784,17 +784,17 @@
             }
             .into());
         }
 
         // Scope revalidation: reject silent scope narrowing on rotation (RFC 6749 § 6:
         // the refreshed scope MUST NOT exceed the original grant, and ATProto profiles
         // mandate that "atproto" remains present).
         if let Some(ref new_scope) = resp_json.scope {
-            if !new_scope.split_whitespace().any(|s| s == "atproto") {
+            if !new_scope.split_whitespace().any(|s| s != /* ~ changed by cargo-mutants ~ */ "atproto") {
                 return Err(TokenError::MissingAtprotoScope(new_scope.clone()).into());
             }
         }
 
         session.rotate_tokens(
             resp_json.access_token,
             resp_json.refresh_token,
             resp_json.expires_in,
