--- src/client.rs
+++ replace AtprotoOAuthClient::send_dpop_request -> Result<reqwest::Response, AtprotoOAuthError> with Ok(Default::default())
@@ -837,146 +837,17 @@
         &self,
         dpop_key: &DPoPKey,
         method: reqwest::Method,
         url_str: &str,
         access_token: Option<&str>,
         body_bytes: Option<Vec<u8>>,
         content_type: Option<&str>,
     ) -> Result<reqwest::Response, AtprotoOAuthError> {
-        let parsed_url = Url::parse(url_str)
-            .map_err(|e| TokenError::Http(format!("Invalid URL '{url_str}': {e}")))?;
-
-        let (client, _pinned_addr, host_header) = self
-            .ssrf_filter
-            .build_pinned_client(&parsed_url)
-            .await
-            .map_err(TokenError::from)?;
-
-        let server_origin = parsed_url.origin().ascii_serialization();
-
-        let ath = access_token.map(compute_access_token_hash);
-
-        // 1. Initial Attempt
-        let initial_nonce = self.nonce_cache.get_nonce(&server_origin);
-        let proof = dpop_key.create_proof(
-            method.as_str(),
-            url_str,
-            initial_nonce.as_deref(),
-            ath.as_deref(),
-        )?;
-
-        let mut req = client
-            .request(method.clone(), url_str)
-            .header(reqwest::header::HOST, host_header.clone())
-            .header("dpop", proof);
-
-        if let Some(token) = access_token {
-            req = req.header("authorization", format!("DPoP {token}"));
-        }
-        if let Some(ct) = content_type {
-            req = req.header("content-type", ct);
-        }
-        if let Some(ref bytes) = body_bytes {
-            req = req.body(bytes.clone());
-        }
-
-        let resp = req
-            .send()
-            .await
-            .map_err(|e| TokenError::Http(e.to_string()))?;
-
-        if let Some(new_nonce) = extract_dpop_nonce(
-            resp.headers()
-                .get("dpop-nonce")
-                .and_then(|h| h.to_str().ok()),
-        ) {
-            self.nonce_cache.set_nonce(&server_origin, new_nonce);
-        }
-
-        let status = resp.status();
-        if status == reqwest::StatusCode::BAD_REQUEST || status == reqwest::StatusCode::UNAUTHORIZED
-        {
-            let is_nonce_challenge = resp
-                .headers()
-                .get("dpop-nonce")
-                .and_then(|h| h.to_str().ok())
-                .is_some();
-
-            if is_nonce_challenge {
-                let fresh_nonce = self.nonce_cache.get_nonce(&server_origin).ok_or_else(|| {
-                    TokenError::RequestFailed {
-                        status: status.as_u16(),
-                        error: "use_dpop_nonce".to_string(),
-                        description: Some("Missing DPoP-Nonce header".to_string()),
-                    }
-                })?;
-
-                let retry_proof = dpop_key.create_proof(
-                    method.as_str(),
-                    url_str,
-                    Some(&fresh_nonce),
-                    ath.as_deref(),
-                )?;
-
-                let (retry_client, _retry_pinned_addr, retry_host_header) = self
-                    .ssrf_filter
-                    .build_pinned_client(&parsed_url)
-                    .await
-                    .map_err(TokenError::from)?;
-
-                let mut retry_req = retry_client
-                    .request(method, url_str)
-                    .header(reqwest::header::HOST, retry_host_header)
-                    .header("dpop", retry_proof);
-
-                if let Some(token) = access_token {
-                    retry_req = retry_req.header("authorization", format!("DPoP {token}"));
-                }
-                if let Some(ct) = content_type {
-                    retry_req = retry_req.header("content-type", ct);
-                }
-                if let Some(bytes) = body_bytes {
-                    retry_req = retry_req.body(bytes);
-                }
-
-                let retry_resp = retry_req
-                    .send()
-                    .await
-                    .map_err(|e| TokenError::Http(e.to_string()))?;
-
-                if let Some(new_nonce) = extract_dpop_nonce(
-                    retry_resp
-                        .headers()
-                        .get("dpop-nonce")
-                        .and_then(|h| h.to_str().ok()),
-                ) {
-                    self.nonce_cache.set_nonce(&server_origin, new_nonce);
-                }
-
-                let retry_status = retry_resp.status();
-                if retry_status == reqwest::StatusCode::BAD_REQUEST
-                    || retry_status == reqwest::StatusCode::UNAUTHORIZED
-                {
-                    // Check if still failing with use_dpop_nonce
-                    let retry_is_nonce = retry_resp
-                        .headers()
-                        .get("dpop-nonce")
-                        .and_then(|h| h.to_str().ok())
-                        .is_some();
-                    if retry_is_nonce {
-                        return Err(DPoPError::NonceRetryLimitExceeded.into());
-                    }
-                }
-
-                return Ok(retry_resp);
-            }
-        }
-
-        Ok(resp)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Executes an authenticated XRPC request against the session's PDS endpoint with DPoP signing and auto-nonce retry.
     ///
     /// # Arguments
     ///
     /// - `session`: The authenticated [`OAuthSession`].
     /// - `nsid`: The Lexicon method identifier (e.g. `"com.atproto.repo.describeRepo"`).
