--- src/crypto.rs
+++ replace verify_p256_raw -> Result<(), CryptoError> with Ok(())
@@ -161,29 +161,17 @@
 ///
 /// Returns [`CryptoError::EcdsaVerify`] if the signature length is not 64 bytes or if
 /// the signature is cryptographically invalid.
 pub fn verify_p256_raw(
     verifying_key: &VerifyingKey,
     message: &[u8],
     signature_bytes: &[u8],
 ) -> Result<(), CryptoError> {
-    if signature_bytes.len() != 64 {
-        return Err(CryptoError::EcdsaVerify(format!(
-            "Invalid IEEE P1363 signature length: expected 64 bytes, got {}",
-            signature_bytes.len()
-        )));
-    }
-
-    let sig = Signature::from_slice(signature_bytes)
-        .map_err(|e| CryptoError::EcdsaVerify(format!("Failed to parse signature: {e}")))?;
-
-    verifying_key
-        .verify(message, &sig)
-        .map_err(|e| CryptoError::EcdsaVerify(format!("Signature verification failed: {e}")))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Constructs a NIST P-256 [`VerifyingKey`] from uncompressed affine coordinates (x, y).
 ///
 /// # Errors
 ///
 /// Returns [`CryptoError::InvalidPoint`] if the coordinates do not lie on the curve.
 pub fn verifying_key_from_coordinates(
