--- src/crypto.rs
+++ replace hmac_sha256 -> Result<[u8; 32], CryptoError> with Ok([0; 32])
@@ -65,24 +65,17 @@
 ///
 /// ```
 /// use skyauth::crypto::hmac_sha256;
 ///
 /// let mac = hmac_sha256(b"my-secret-key", b"message content").expect("hmac generation");
 /// assert_eq!(mac.len(), 32);
 /// ```
 pub fn hmac_sha256(key: &[u8], message: &[u8]) -> Result<[u8; 32], CryptoError> {
-    type HmacSha256 = Hmac<Sha256>;
-    let mut mac = HmacSha256::new_from_slice(key)
-        .map_err(|e| CryptoError::Hmac(format!("Failed to initialize HMAC: {e}")))?;
-    mac.update(message);
-    let result = mac.finalize().into_bytes();
-    let mut out = [0u8; 32];
-    out.copy_from_slice(&result);
-    Ok(out)
+    Ok([0; 32]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Encodes binary data into an unpadded URL-safe Base64 string (RFC 4648 § 5).
 ///
 /// # Examples
 ///
 /// ```
 /// use skyauth::crypto::base64url_encode;
