--- src/discovery.rs
+++ replace fetch_auth_server_metadata -> Result<AuthorizationServerMetadata, DiscoveryError> with Ok(Default::default())
@@ -241,56 +241,17 @@
 /// - Returns [`DiscoveryError::IssuerMismatch`] if `issuer` does not match `auth_server_url`.
 /// - Returns [`DiscoveryError::MissingDpopAlgorithm`] if `ES256` is missing.
 /// - Returns [`DiscoveryError::MissingPkceMethod`] if `S256` is missing.
 /// - Returns [`DiscoveryError::MissingParEndpoint`] if PAR endpoint is missing.
 pub async fn fetch_auth_server_metadata(
     ssrf_filter: &SsrfFilter,
     auth_server_url: &str,
 ) -> Result<AuthorizationServerMetadata, DiscoveryError> {
-    let base = auth_server_url.trim_end_matches('/');
-    let primary_url = format!("{base}/.well-known/oauth-authorization-server");
-
-    let meta: AuthorizationServerMetadata = match ssrf_filter
-        .safe_get_json(&primary_url, MAX_OAUTH_RESPONSE_BYTES)
-        .await
-    {
-        Ok(m) => m,
-        Err(SsrfError::HttpStatus(404, _)) => {
-            let fallback_url = format!("{base}/.well-known/openid-configuration");
-            ssrf_filter
-                .safe_get_json(&fallback_url, MAX_OAUTH_RESPONSE_BYTES)
-                .await
-                .map_err(|e| match e {
-                    SsrfError::HttpStatus(status, msg) => {
-                        DiscoveryError::AuthServerDiscoveryFailed(format!(
-                            "HTTP {status} fetching fallback authorization server metadata from {fallback_url}: {msg}"
-                        ))
-                    }
-                    SsrfError::Json(err) => DiscoveryError::AuthServerDiscoveryFailed(format!(
-                        "Invalid JSON in fallback authorization server metadata from {fallback_url}: {err}"
-                    )),
-                    other => DiscoveryError::Ssrf(other),
-                })?
-        }
-        Err(SsrfError::HttpStatus(status, msg)) => {
-            return Err(DiscoveryError::AuthServerDiscoveryFailed(format!(
-                "HTTP {status} fetching authorization server metadata from {primary_url}: {msg}"
-            )));
-        }
-        Err(SsrfError::Json(err)) => {
-            return Err(DiscoveryError::AuthServerDiscoveryFailed(format!(
-                "Invalid JSON in authorization server metadata from {primary_url}: {err}"
-            )));
-        }
-        Err(other) => return Err(DiscoveryError::Ssrf(other)),
-    };
-
-    validate_auth_server_capabilities(&meta, auth_server_url)?;
-    Ok(meta)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Validates security capabilities and invariant compliance on Authorization Server Metadata
 /// according to the AT Protocol OAuth specification profile.
 pub fn validate_auth_server_capabilities(
     meta: &AuthorizationServerMetadata,
     auth_server_url: &str,
 ) -> Result<(), DiscoveryError> {
