--- src/discovery.rs
+++ replace validate_auth_server_capabilities -> Result<(), DiscoveryError> with Ok(())
@@ -290,187 +290,17 @@
 
 /// Validates security capabilities and invariant compliance on Authorization Server Metadata
 /// according to the AT Protocol OAuth specification profile.
 pub fn validate_auth_server_capabilities(
     meta: &AuthorizationServerMetadata,
     auth_server_url: &str,
 ) -> Result<(), DiscoveryError> {
     // 1. Issuer Origin Equality & Origin-only Check
-    if !is_origin_only(auth_server_url) {
-        return Err(DiscoveryError::InvalidAuthorizationServerUrl(
-            auth_server_url.to_string(),
-        ));
-    }
-    if !is_origin_only(&meta.issuer) {
-        return Err(DiscoveryError::InvalidAuthorizationServerUrl(
-            meta.issuer.clone(),
-        ));
-    }
-    let expected_origin = normalize_origin(auth_server_url);
-    let actual_origin = normalize_origin(&meta.issuer);
-    if expected_origin != actual_origin {
-        return Err(DiscoveryError::IssuerMismatch {
-            expected: auth_server_url.to_string(),
-            actual: meta.issuer.clone(),
-        });
-    }
-
-    // 2. PAR Endpoint Validation
-    if meta.pushed_authorization_request_endpoint.trim().is_empty() {
-        return Err(DiscoveryError::MissingParEndpoint(
-            auth_server_url.to_string(),
-        ));
-    }
-    if let Err(e) = Url::parse(&meta.pushed_authorization_request_endpoint) {
-        return Err(DiscoveryError::InvalidEndpointUrl(format!(
-            "Invalid PAR endpoint URL '{}': {e}",
-            meta.pushed_authorization_request_endpoint
-        )));
-    }
-
-    // 3. Mandatory PAR Requirement (ATProto profile mandates PAR)
-    if !meta.require_pushed_authorization_requests {
-        return Err(DiscoveryError::ParNotRequired(auth_server_url.to_string()));
-    }
-
-    // 4. Token Endpoint Validation
-    if meta.token_endpoint.trim().is_empty() {
-        return Err(DiscoveryError::MissingTokenEndpoint(
-            auth_server_url.to_string(),
-        ));
-    }
-    if let Err(e) = Url::parse(&meta.token_endpoint) {
-        return Err(DiscoveryError::InvalidEndpointUrl(format!(
-            "Invalid token endpoint URL '{}': {e}",
-            meta.token_endpoint
-        )));
-    }
-
-    // 5. Authorization Endpoint Validation
-    if meta.authorization_endpoint.trim().is_empty() {
-        return Err(DiscoveryError::MissingAuthorizationEndpoint(
-            auth_server_url.to_string(),
-        ));
-    }
-    if let Err(e) = Url::parse(&meta.authorization_endpoint) {
-        return Err(DiscoveryError::InvalidEndpointUrl(format!(
-            "Invalid authorization endpoint URL '{}': {e}",
-            meta.authorization_endpoint
-        )));
-    }
-
-    // 6. Response Types Supported Enforcement (must include "code")
-    if !meta.response_types_supported.iter().any(|r| r == "code") {
-        return Err(DiscoveryError::MissingResponseType(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    // 7. Grant Types Supported Enforcement (must include "authorization_code" and "refresh_token")
-    if !meta
-        .grant_types_supported
-        .iter()
-        .any(|g| g == "authorization_code")
-    {
-        return Err(DiscoveryError::MissingGrantType {
-            auth_server: auth_server_url.to_string(),
-            missing: "authorization_code".to_string(),
-        });
-    }
-    if !meta
-        .grant_types_supported
-        .iter()
-        .any(|g| g == "refresh_token")
-    {
-        return Err(DiscoveryError::MissingGrantType {
-            auth_server: auth_server_url.to_string(),
-            missing: "refresh_token".to_string(),
-        });
-    }
-
-    // 8. Token Endpoint Auth Methods Supported Enforcement (ATProto profile mandates both "none" and "private_key_jwt")
-    let has_none = meta
-        .token_endpoint_auth_methods_supported
-        .iter()
-        .any(|m| m == "none");
-    let has_private_key_jwt = meta
-        .token_endpoint_auth_methods_supported
-        .iter()
-        .any(|m| m == "private_key_jwt");
-    if !has_none || !has_private_key_jwt {
-        return Err(DiscoveryError::MissingTokenAuthMethod(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    // 8b. Token Endpoint Auth Signing Alg Values Supported (mandates "ES256", rejects "none")
-    if !meta
-        .token_endpoint_auth_signing_alg_values_supported
-        .iter()
-        .any(|alg| alg == "ES256")
-    {
-        return Err(DiscoveryError::MissingTokenAuthSigningAlg(
-            auth_server_url.to_string(),
-        ));
-    }
-    if meta
-        .token_endpoint_auth_signing_alg_values_supported
-        .iter()
-        .any(|alg| alg == "none")
-    {
-        return Err(DiscoveryError::InvalidTokenAuthSigningAlg(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    // 9. Scopes Supported Enforcement (must include "atproto")
-    if !meta.scopes_supported.iter().any(|s| s == "atproto") {
-        return Err(DiscoveryError::MissingAtprotoScope(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    // 10. Authorization Response ISS Parameter Supported (RFC 9207 is mandatory in ATProto)
-    if !meta.authorization_response_iss_parameter_supported {
-        return Err(DiscoveryError::MissingIssParameterSupport(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    // 11. Client ID Metadata Document Supported (Mandatory in ATProto)
-    if !meta.client_id_metadata_document_supported {
-        return Err(DiscoveryError::MissingClientMetadataSupport(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    // 12. DPoP ES256 Algorithm Enforcement
-    if !meta
-        .dpop_signing_alg_values_supported
-        .iter()
-        .any(|alg| alg == "ES256")
-    {
-        return Err(DiscoveryError::MissingDpopAlgorithm(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    // 13. PKCE S256 Challenge Method Enforcement
-    if !meta
-        .code_challenge_methods_supported
-        .iter()
-        .any(|method| method == "S256")
-    {
-        return Err(DiscoveryError::MissingPkceMethod(
-            auth_server_url.to_string(),
-        ));
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Executes the complete AT Protocol discovery pipeline for a user handle or DID.
 ///
 /// # Multi-Stage Execution:
 /// 1. Resolves identity (Handle -> DID -> DID Document, or DID -> DID Document).
 /// 2. Verifies bidirectional handle linkage if a handle was provided.
 /// 3. Extracts the authoritative `#atproto_pds` service endpoint.
