--- src/discovery.rs
+++ delete ! in validate_auth_server_capabilities
@@ -295,17 +295,17 @@
     auth_server_url: &str,
 ) -> Result<(), DiscoveryError> {
     // 1. Issuer Origin Equality & Origin-only Check
     if !is_origin_only(auth_server_url) {
         return Err(DiscoveryError::InvalidAuthorizationServerUrl(
             auth_server_url.to_string(),
         ));
     }
-    if !is_origin_only(&meta.issuer) {
+    if  /* ~ changed by cargo-mutants ~ */is_origin_only(&meta.issuer) {
         return Err(DiscoveryError::InvalidAuthorizationServerUrl(
             meta.issuer.clone(),
         ));
     }
     let expected_origin = normalize_origin(auth_server_url);
     let actual_origin = normalize_origin(&meta.issuer);
     if expected_origin != actual_origin {
         return Err(DiscoveryError::IssuerMismatch {
