--- src/discovery.rs
+++ replace != with == in validate_auth_server_capabilities
@@ -302,17 +302,17 @@
     }
     if !is_origin_only(&meta.issuer) {
         return Err(DiscoveryError::InvalidAuthorizationServerUrl(
             meta.issuer.clone(),
         ));
     }
     let expected_origin = normalize_origin(auth_server_url);
     let actual_origin = normalize_origin(&meta.issuer);
-    if expected_origin != actual_origin {
+    if expected_origin == /* ~ changed by cargo-mutants ~ */ actual_origin {
         return Err(DiscoveryError::IssuerMismatch {
             expected: auth_server_url.to_string(),
             actual: meta.issuer.clone(),
         });
     }
 
     // 2. PAR Endpoint Validation
     if meta.pushed_authorization_request_endpoint.trim().is_empty() {
