--- src/discovery.rs
+++ delete ! in validate_auth_server_capabilities
@@ -323,17 +323,17 @@
     if let Err(e) = Url::parse(&meta.pushed_authorization_request_endpoint) {
         return Err(DiscoveryError::InvalidEndpointUrl(format!(
             "Invalid PAR endpoint URL '{}': {e}",
             meta.pushed_authorization_request_endpoint
         )));
     }
 
     // 3. Mandatory PAR Requirement (ATProto profile mandates PAR)
-    if !meta.require_pushed_authorization_requests {
+    if  /* ~ changed by cargo-mutants ~ */meta.require_pushed_authorization_requests {
         return Err(DiscoveryError::ParNotRequired(auth_server_url.to_string()));
     }
 
     // 4. Token Endpoint Validation
     if meta.token_endpoint.trim().is_empty() {
         return Err(DiscoveryError::MissingTokenEndpoint(
             auth_server_url.to_string(),
         ));
