--- src/discovery.rs
+++ replace == with != in validate_auth_server_capabilities
@@ -354,17 +354,17 @@
     if let Err(e) = Url::parse(&meta.authorization_endpoint) {
         return Err(DiscoveryError::InvalidEndpointUrl(format!(
             "Invalid authorization endpoint URL '{}': {e}",
             meta.authorization_endpoint
         )));
     }
 
     // 6. Response Types Supported Enforcement (must include "code")
-    if !meta.response_types_supported.iter().any(|r| r == "code") {
+    if !meta.response_types_supported.iter().any(|r| r != /* ~ changed by cargo-mutants ~ */ "code") {
         return Err(DiscoveryError::MissingResponseType(
             auth_server_url.to_string(),
         ));
     }
 
     // 7. Grant Types Supported Enforcement (must include "authorization_code" and "refresh_token")
     if !meta
         .grant_types_supported
