--- src/discovery.rs
+++ replace == with != in validate_auth_server_capabilities
@@ -364,17 +364,17 @@
             auth_server_url.to_string(),
         ));
     }
 
     // 7. Grant Types Supported Enforcement (must include "authorization_code" and "refresh_token")
     if !meta
         .grant_types_supported
         .iter()
-        .any(|g| g == "authorization_code")
+        .any(|g| g != /* ~ changed by cargo-mutants ~ */ "authorization_code")
     {
         return Err(DiscoveryError::MissingGrantType {
             auth_server: auth_server_url.to_string(),
             missing: "authorization_code".to_string(),
         });
     }
     if !meta
         .grant_types_supported
