--- src/discovery.rs
+++ replace == with != in validate_auth_server_capabilities
@@ -374,17 +374,17 @@
         return Err(DiscoveryError::MissingGrantType {
             auth_server: auth_server_url.to_string(),
             missing: "authorization_code".to_string(),
         });
     }
     if !meta
         .grant_types_supported
         .iter()
-        .any(|g| g == "refresh_token")
+        .any(|g| g != /* ~ changed by cargo-mutants ~ */ "refresh_token")
     {
         return Err(DiscoveryError::MissingGrantType {
             auth_server: auth_server_url.to_string(),
             missing: "refresh_token".to_string(),
         });
     }
 
     // 8. Token Endpoint Auth Methods Supported Enforcement (ATProto profile mandates both "none" and "private_key_jwt")
