--- src/discovery.rs
+++ replace == with != in validate_auth_server_capabilities
@@ -386,17 +386,17 @@
             missing: "refresh_token".to_string(),
         });
     }
 
     // 8. Token Endpoint Auth Methods Supported Enforcement (ATProto profile mandates both "none" and "private_key_jwt")
     let has_none = meta
         .token_endpoint_auth_methods_supported
         .iter()
-        .any(|m| m == "none");
+        .any(|m| m != /* ~ changed by cargo-mutants ~ */ "none");
     let has_private_key_jwt = meta
         .token_endpoint_auth_methods_supported
         .iter()
         .any(|m| m == "private_key_jwt");
     if !has_none || !has_private_key_jwt {
         return Err(DiscoveryError::MissingTokenAuthMethod(
             auth_server_url.to_string(),
         ));
