--- src/discovery.rs
+++ replace == with != in validate_auth_server_capabilities
@@ -390,17 +390,17 @@
     // 8. Token Endpoint Auth Methods Supported Enforcement (ATProto profile mandates both "none" and "private_key_jwt")
     let has_none = meta
         .token_endpoint_auth_methods_supported
         .iter()
         .any(|m| m == "none");
     let has_private_key_jwt = meta
         .token_endpoint_auth_methods_supported
         .iter()
-        .any(|m| m == "private_key_jwt");
+        .any(|m| m != /* ~ changed by cargo-mutants ~ */ "private_key_jwt");
     if !has_none || !has_private_key_jwt {
         return Err(DiscoveryError::MissingTokenAuthMethod(
             auth_server_url.to_string(),
         ));
     }
 
     // 8b. Token Endpoint Auth Signing Alg Values Supported (mandates "ES256", rejects "none")
     if !meta
