--- src/discovery.rs
+++ delete ! in validate_auth_server_capabilities
@@ -391,17 +391,17 @@
     let has_none = meta
         .token_endpoint_auth_methods_supported
         .iter()
         .any(|m| m == "none");
     let has_private_key_jwt = meta
         .token_endpoint_auth_methods_supported
         .iter()
         .any(|m| m == "private_key_jwt");
-    if !has_none || !has_private_key_jwt {
+    if  /* ~ changed by cargo-mutants ~ */has_none || !has_private_key_jwt {
         return Err(DiscoveryError::MissingTokenAuthMethod(
             auth_server_url.to_string(),
         ));
     }
 
     // 8b. Token Endpoint Auth Signing Alg Values Supported (mandates "ES256", rejects "none")
     if !meta
         .token_endpoint_auth_signing_alg_values_supported
