--- src/discovery.rs
+++ delete ! in validate_auth_server_capabilities
@@ -398,17 +398,17 @@
         .any(|m| m == "private_key_jwt");
     if !has_none || !has_private_key_jwt {
         return Err(DiscoveryError::MissingTokenAuthMethod(
             auth_server_url.to_string(),
         ));
     }
 
     // 8b. Token Endpoint Auth Signing Alg Values Supported (mandates "ES256", rejects "none")
-    if !meta
+    if  /* ~ changed by cargo-mutants ~ */meta
         .token_endpoint_auth_signing_alg_values_supported
         .iter()
         .any(|alg| alg == "ES256")
     {
         return Err(DiscoveryError::MissingTokenAuthSigningAlg(
             auth_server_url.to_string(),
         ));
     }
