--- src/discovery.rs
+++ replace || with && in is_origin_only
@@ -114,17 +114,17 @@
     if let Ok(parsed) = Url::parse(url_str) {
         let scheme = parsed.scheme();
         let host = parsed.host_str().unwrap_or("");
         let is_loopback =
             host == "localhost" || host == "127.0.0.1" || host == "::1" || host == "[::1]";
         if scheme != "https" && !(scheme == "http" && is_loopback) {
             return false;
         }
-        if !parsed.username().is_empty() || parsed.password().is_some() {
+        if !parsed.username().is_empty() && /* ~ changed by cargo-mutants ~ */ parsed.password().is_some() {
             return false;
         }
         // Reject explicit default port spellings (`:443` for https, `:80` for http).
         // The `url` crate normalizes default ports during parsing (`port()` returns
         // `None` for an explicit `:443`), so the explicit form must be detected from
         // the raw AUTHORITY segment of the original string — scanning only there
         // avoids false positives from ports that merely contain ":443"/":80"
         // (e.g. an ephemeral test-server port like 44371).
