--- src/discovery.rs
+++ replace == with != in validate_auth_server_capabilities
@@ -410,17 +410,17 @@
     {
         return Err(DiscoveryError::MissingTokenAuthSigningAlg(
             auth_server_url.to_string(),
         ));
     }
     if meta
         .token_endpoint_auth_signing_alg_values_supported
         .iter()
-        .any(|alg| alg == "none")
+        .any(|alg| alg != /* ~ changed by cargo-mutants ~ */ "none")
     {
         return Err(DiscoveryError::InvalidTokenAuthSigningAlg(
             auth_server_url.to_string(),
         ));
     }
 
     // 9. Scopes Supported Enforcement (must include "atproto")
     if !meta.scopes_supported.iter().any(|s| s == "atproto") {
