--- src/discovery.rs
+++ delete ! in validate_auth_server_capabilities
@@ -425,17 +425,17 @@
     // 9. Scopes Supported Enforcement (must include "atproto")
     if !meta.scopes_supported.iter().any(|s| s == "atproto") {
         return Err(DiscoveryError::MissingAtprotoScope(
             auth_server_url.to_string(),
         ));
     }
 
     // 10. Authorization Response ISS Parameter Supported (RFC 9207 is mandatory in ATProto)
-    if !meta.authorization_response_iss_parameter_supported {
+    if  /* ~ changed by cargo-mutants ~ */meta.authorization_response_iss_parameter_supported {
         return Err(DiscoveryError::MissingIssParameterSupport(
             auth_server_url.to_string(),
         ));
     }
 
     // 11. Client ID Metadata Document Supported (Mandatory in ATProto)
     if !meta.client_id_metadata_document_supported {
         return Err(DiscoveryError::MissingClientMetadataSupport(
