--- src/discovery.rs
+++ delete ! in validate_auth_server_capabilities
@@ -432,17 +432,17 @@
     // 10. Authorization Response ISS Parameter Supported (RFC 9207 is mandatory in ATProto)
     if !meta.authorization_response_iss_parameter_supported {
         return Err(DiscoveryError::MissingIssParameterSupport(
             auth_server_url.to_string(),
         ));
     }
 
     // 11. Client ID Metadata Document Supported (Mandatory in ATProto)
-    if !meta.client_id_metadata_document_supported {
+    if  /* ~ changed by cargo-mutants ~ */meta.client_id_metadata_document_supported {
         return Err(DiscoveryError::MissingClientMetadataSupport(
             auth_server_url.to_string(),
         ));
     }
 
     // 12. DPoP ES256 Algorithm Enforcement
     if !meta
         .dpop_signing_alg_values_supported
