--- src/discovery.rs
+++ delete ! in validate_auth_server_capabilities
@@ -450,17 +450,17 @@
         .any(|alg| alg == "ES256")
     {
         return Err(DiscoveryError::MissingDpopAlgorithm(
             auth_server_url.to_string(),
         ));
     }
 
     // 13. PKCE S256 Challenge Method Enforcement
-    if !meta
+    if  /* ~ changed by cargo-mutants ~ */meta
         .code_challenge_methods_supported
         .iter()
         .any(|method| method == "S256")
     {
         return Err(DiscoveryError::MissingPkceMethod(
             auth_server_url.to_string(),
         ));
     }
