--- src/discovery.rs
+++ delete ! in discover_oauth_endpoints
@@ -498,17 +498,17 @@
         did: identity.did,
         handle: identity.handle,
         pds_endpoint: identity.pds_endpoint,
         auth_server_issuer: as_meta.issuer.clone(),
         par_endpoint: as_meta.pushed_authorization_request_endpoint.clone(),
         authorization_endpoint: as_meta.authorization_endpoint.clone(),
         token_endpoint: as_meta.token_endpoint.clone(),
         dpop_algs: as_meta.dpop_signing_alg_values_supported.clone(),
-        scopes: if !as_meta.scopes_supported.is_empty() {
+        scopes: if  /* ~ changed by cargo-mutants ~ */as_meta.scopes_supported.is_empty() {
             as_meta.scopes_supported.clone()
         } else if !pds_meta.scopes_supported.is_empty() {
             pds_meta.scopes_supported.clone()
         } else {
             vec!["atproto".to_string()]
         },
         protected_resource_metadata: pds_meta,
         auth_server_metadata: as_meta,
