--- src/dpop.rs
+++ replace DPoPKey::from_pkcs8_der -> Result<Self, CryptoError> with Ok(Default::default())
@@ -150,19 +150,17 @@
     }
 
     /// Imports an ECDSA P-256 private key from PKCS#8 DER bytes.
     ///
     /// # Errors
     ///
     /// Returns [`CryptoError::InvalidKey`] if the bytes cannot be parsed.
     pub fn from_pkcs8_der(der_bytes: &[u8]) -> Result<Self, CryptoError> {
-        let signing_key = SigningKey::from_pkcs8_der(der_bytes)
-            .map_err(|e| CryptoError::InvalidKey(format!("Invalid PKCS#8 DER key: {e}")))?;
-        Ok(Self { signing_key })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Imports an ECDSA P-256 private key from a PKCS#8 PEM string.
     ///
     /// # Errors
     ///
     /// Returns [`CryptoError::Pem`] if the PEM string is invalid.
     pub fn from_pkcs8_pem(pem: &str) -> Result<Self, CryptoError> {
