--- src/discovery.rs
+++ replace fetch_protected_resource_metadata -> Result<ProtectedResourceMetadata, DiscoveryError> with Ok(Default::default())
@@ -173,65 +173,17 @@
 /// - Returns [`DiscoveryError::MultipleAuthorizationServers`] if more than 1 authorization server is listed.
 /// - Returns [`DiscoveryError::InvalidAuthorizationServerUrl`] if the authorization server URL is not a valid origin.
 /// - Returns [`DiscoveryError::ResourceMismatch`] if the `resource` field does not match the PDS endpoint origin.
 /// - Returns [`DiscoveryError::ProtectedResourceDiscoveryFailed`] if the HTTP request or JSON parsing fails.
 pub async fn fetch_protected_resource_metadata(
     ssrf_filter: &SsrfFilter,
     pds_endpoint: &str,
 ) -> Result<ProtectedResourceMetadata, DiscoveryError> {
-    let url = format!(
-        "{}/.well-known/oauth-protected-resource",
-        pds_endpoint.trim_end_matches('/')
-    );
-
-    let meta: ProtectedResourceMetadata = ssrf_filter
-        .safe_get_json(&url, MAX_OAUTH_RESPONSE_BYTES)
-        .await
-        .map_err(|e| match e {
-            SsrfError::HttpStatus(status, msg) => DiscoveryError::ProtectedResourceDiscoveryFailed(
-                format!("HTTP {status} fetching protected resource metadata from {url}: {msg}"),
-            ),
-            SsrfError::Json(err) => DiscoveryError::ProtectedResourceDiscoveryFailed(format!(
-                "Invalid JSON in protected resource metadata from {url}: {err}"
-            )),
-            other => DiscoveryError::Ssrf(other),
-        })?;
-
-    // 1. ATProto requires exactly one Authorization Server
-    if meta.authorization_servers.is_empty() {
-        return Err(DiscoveryError::MissingAuthorizationServers(
-            pds_endpoint.to_string(),
-        ));
-    }
-    if meta.authorization_servers.len() > 1 {
-        return Err(DiscoveryError::MultipleAuthorizationServers(
-            meta.authorization_servers.len(),
-        ));
-    }
-
-    // 2. The Authorization Server URL must be an origin-only URL
-    let as_url = &meta.authorization_servers[0];
-    if !is_origin_only(as_url) {
-        return Err(DiscoveryError::InvalidAuthorizationServerUrl(
-            as_url.clone(),
-        ));
-    }
-
-    // 3. Resource Match Check (must match queried PDS origin)
-    let expected_origin = normalize_origin(pds_endpoint);
-    let actual_origin = normalize_origin(&meta.resource);
-    if expected_origin != actual_origin {
-        return Err(DiscoveryError::ResourceMismatch {
-            expected: expected_origin,
-            actual: meta.resource.clone(),
-        });
-    }
-
-    Ok(meta)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Fetches and parses RFC 8414 Authorization Server Metadata with OIDC fallback.
 ///
 /// # Invariants
 /// 1. Tries primary endpoint: `<auth_server>/.well-known/oauth-authorization-server`.
 /// 2. If primary returns 404, falls back to: `<auth_server>/.well-known/openid-configuration`.
 /// 3. Validates mandatory security invariants: `issuer` matching, `ES256` DPoP support,
