--- src/discovery.rs
+++ delete ! in fetch_protected_resource_metadata
@@ -205,17 +205,17 @@
     if meta.authorization_servers.len() > 1 {
         return Err(DiscoveryError::MultipleAuthorizationServers(
             meta.authorization_servers.len(),
         ));
     }
 
     // 2. The Authorization Server URL must be an origin-only URL
     let as_url = &meta.authorization_servers[0];
-    if !is_origin_only(as_url) {
+    if  /* ~ changed by cargo-mutants ~ */is_origin_only(as_url) {
         return Err(DiscoveryError::InvalidAuthorizationServerUrl(
             as_url.clone(),
         ));
     }
 
     // 3. Resource Match Check (must match queried PDS origin)
     let expected_origin = normalize_origin(pds_endpoint);
     let actual_origin = normalize_origin(&meta.resource);
