--- src/dpop.rs
+++ replace DPoPKey::from_bytes_b64 -> Result<Self, CryptoError> with Ok(Default::default())
@@ -211,20 +211,17 @@
     }
 
     /// Imports an ECDSA P-256 private key from a Base64URL-encoded scalar string.
     ///
     /// # Errors
     ///
     /// Returns [`CryptoError`] if decoding or key parsing fails.
     pub fn from_bytes_b64(b64: &str) -> Result<Self, CryptoError> {
-        let mut bytes = base64url_decode(b64)?;
-        let res = Self::from_slice(&bytes);
-        bytes.zeroize();
-        res
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Derives the public [`JwkEc`] representation corresponding to this keypair.
     #[must_use]
     pub fn public_jwk(&self) -> JwkEc {
         let verifying_key = self.signing_key.verifying_key();
         let (x_bytes, y_bytes) = verifying_key_to_coordinates(verifying_key);
         JwkEc {
