--- src/discovery.rs
+++ replace != with == in fetch_protected_resource_metadata
@@ -214,17 +214,17 @@
         return Err(DiscoveryError::InvalidAuthorizationServerUrl(
             as_url.clone(),
         ));
     }
 
     // 3. Resource Match Check (must match queried PDS origin)
     let expected_origin = normalize_origin(pds_endpoint);
     let actual_origin = normalize_origin(&meta.resource);
-    if expected_origin != actual_origin {
+    if expected_origin == /* ~ changed by cargo-mutants ~ */ actual_origin {
         return Err(DiscoveryError::ResourceMismatch {
             expected: expected_origin,
             actual: meta.resource.clone(),
         });
     }
 
     Ok(meta)
 }
