--- src/dpop.rs
+++ replace JwkEc::to_verifying_key -> Result<VerifyingKey, CryptoError> with Ok(Default::default())
@@ -69,19 +69,17 @@
 
     /// Reconstructs the [`VerifyingKey`] from the JWK (x, y) coordinates.
     ///
     /// # Errors
     ///
     /// Returns [`CryptoError::InvalidPoint`] or [`CryptoError::Base64Decode`] if the
     /// coordinates are invalid.
     pub fn to_verifying_key(&self) -> Result<VerifyingKey, CryptoError> {
-        let x_bytes: [u8; 32] = base64url_decode_fixed(&self.x)?;
-        let y_bytes: [u8; 32] = base64url_decode_fixed(&self.y)?;
-        verifying_key_from_coordinates(&x_bytes, &y_bytes)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// An ephemeral or persistent ECDSA P-256 keypair for DPoP proof signing.
 ///
 /// # Memory Guarantees
 /// The underlying [`p256::ecdsa::SigningKey`] zeroizes the private scalar on drop
 /// (guaranteed by the `ecdsa` crate's `ZeroizeOnDrop` implementation). Auxiliary
