--- src/dpop.rs
+++ replace <impl std::fmt::Debug for DPoPKey>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -98,19 +98,17 @@
         self.signing_key.to_bytes() == other.signing_key.to_bytes()
     }
 }
 
 impl Eq for DPoPKey {}
 
 impl std::fmt::Debug for DPoPKey {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.debug_struct("DPoPKey")
-            .field("thumbprint", &self.jwk_thumbprint())
-            .finish()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl serde::Serialize for DPoPKey {
     fn serialize<S>(&self, serializer: S) -> Result<S::Ok, S::Error>
     where
         S: serde::Serializer,
     {
