--- src/dpop.rs
+++ replace <impl serde::Serialize for DPoPKey>::serialize -> Result<S::Ok, S::Error> with Ok(Default::default())
@@ -109,18 +109,17 @@
     }
 }
 
 impl serde::Serialize for DPoPKey {
     fn serialize<S>(&self, serializer: S) -> Result<S::Ok, S::Error>
     where
         S: serde::Serializer,
     {
-        let pem = self.to_pkcs8_pem().map_err(serde::ser::Error::custom)?;
-        serializer.serialize_str(&pem)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'de> serde::Deserialize<'de> for DPoPKey {
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: serde::Deserializer<'de>,
     {
