--- src/dpop.rs
+++ replace DPoPKey::to_bytes -> Zeroizing<[u8; 32]> with Zeroizing::from([0; 32])
@@ -181,19 +181,17 @@
             .to_pkcs8_pem(LineEnding::LF)
             .map(|zeroizing| zeroizing.as_str().to_string())
             .map_err(|e| CryptoError::Pem(format!("Failed to export PKCS#8 PEM: {e}")))
     }
 
     /// Exports the private key scalar as a zeroized-on-drop 32-byte buffer.
     #[must_use]
     pub fn to_bytes(&self) -> Zeroizing<[u8; 32]> {
-        let mut out = Zeroizing::new([0u8; 32]);
-        out.copy_from_slice(&self.signing_key.to_bytes());
-        out
+        Zeroizing::from([0; 32]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Exports the private key as an unpadded Base64URL string stored in a
     /// zeroized-on-drop buffer.
     #[must_use]
     pub fn to_bytes_b64(&self) -> Zeroizing<String> {
         let raw = self.to_bytes();
         Zeroizing::new(base64url_encode(&*raw))
