--- src/dpop.rs
+++ replace DPoPKey::jwk_thumbprint -> String with "xyzzy".into()
@@ -233,17 +233,17 @@
             x: base64url_encode(&x_bytes),
             y: base64url_encode(&y_bytes),
         }
     }
 
     /// Computes the RFC 7638 SHA-256 JWK Thumbprint (`jkt`) for this key's public component.
     #[must_use]
     pub fn jwk_thumbprint(&self) -> String {
-        self.public_jwk().thumbprint()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Signs an RFC 9449 DPoP proof JWT for an outgoing HTTP request.
     ///
     /// # Parameters
     ///
     /// - `htm`: The HTTP request method (e.g. `"POST"` or `"GET"`). Automatically normalized to uppercase.
     /// - `htu`: The HTTP request target URI. Automatically normalized per RFC 9449 § 4.2.
