--- src/dpop.rs
+++ replace DPoPKey::create_proof -> Result<String, DPoPError> with Ok("xyzzy".into())
@@ -255,22 +255,17 @@
     /// Returns [`DPoPError`] if the URI is invalid, serialization fails, or signing fails.
     pub fn create_proof(
         &self,
         htm: &str,
         htu: &str,
         nonce: Option<&str>,
         ath: Option<&str>,
     ) -> Result<String, DPoPError> {
-        let now_secs = SystemTime::now()
-            .duration_since(UNIX_EPOCH)
-            .map_err(|e| DPoPError::ClockSkew(e.to_string()))?
-            .as_secs();
-
-        self.create_proof_internal(htm, htu, nonce, ath, now_secs, None)
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Internal helper allowing deterministic injection of timestamp and `jti` (for testing/RFC vectors).
     pub(crate) fn create_proof_internal(
         &self,
         htm: &str,
         htu: &str,
         nonce: Option<&str>,
