--- src/dpop.rs
+++ delete ! in DPoPKey::create_proof_internal
@@ -310,17 +310,17 @@
                 payload.insert(
                     "nonce".to_string(),
                     serde_json::Value::String(n.trim().to_string()),
                 );
             }
         }
 
         if let Some(a) = ath {
-            if !a.trim().is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */a.trim().is_empty() {
                 payload.insert(
                     "ath".to_string(),
                     serde_json::Value::String(a.trim().to_string()),
                 );
             }
         }
 
         let header_str =
