--- src/dpop.rs
+++ replace DPoPVerifier::with_max_clock_skew -> Self with Default::default()
@@ -385,18 +385,17 @@
             max_proof_age: DEFAULT_MAX_PROOF_AGE,
             replay_cache: Some(DPoPReplayCache::new()),
         }
     }
 
     /// Sets the maximum allowable clock skew leeway.
     #[must_use]
     pub fn with_max_clock_skew(mut self, skew: Duration) -> Self {
-        self.max_clock_skew = skew;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets the maximum allowable proof age.
     #[must_use]
     pub fn with_max_proof_age(mut self, age: Duration) -> Self {
         self.max_proof_age = age;
         self
     }
