--- src/dpop.rs
+++ replace DPoPVerifier::replay_cache -> Option<&DPoPReplayCache> with None
@@ -419,17 +419,17 @@
             self.replay_cache = None;
         }
         self
     }
 
     /// Returns a reference to the active [`DPoPReplayCache`], if enabled.
     #[must_use]
     pub fn replay_cache(&self) -> Option<&DPoPReplayCache> {
-        self.replay_cache.as_ref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Verifies an inbound RFC 9449 DPoP proof JWT against expected request parameters.
     ///
     /// # Checks Performed
     ///
     /// 1. Compact JWT format: exactly three period-separated parts.
     /// 2. Header `typ`: must be case-insensitively equal to `"dpop+jwt"`.
