--- src/dpop.rs
+++ delete ! in DPoPVerifier::verify_proof
@@ -470,17 +470,17 @@
         let header_val: serde_json::Value = serde_json::from_slice(&header_bytes)
             .map_err(|e| DPoPError::MalformedJwt(format!("Failed to parse header JSON: {e}")))?;
 
         let typ = header_val
             .get("typ")
             .and_then(|v| v.as_str())
             .ok_or_else(|| DPoPError::InvalidHeaderTyp("Missing 'typ' header".to_string()))?;
 
-        if !typ.eq_ignore_ascii_case("dpop+jwt") {
+        if  /* ~ changed by cargo-mutants ~ */typ.eq_ignore_ascii_case("dpop+jwt") {
             return Err(DPoPError::InvalidHeaderTyp(typ.to_string()));
         }
 
         let alg = header_val
             .get("alg")
             .and_then(|v| v.as_str())
             .ok_or_else(|| DPoPError::UnsupportedAlgorithm("Missing 'alg' header".to_string()))?;
 
