--- src/dpop.rs
+++ replace != with == in DPoPVerifier::verify_proof
@@ -493,17 +493,17 @@
         // Ensure JWK does not contain private key material (RFC 9449 § 4.3 item 7)
         if jwk_val.get("d").is_some() {
             return Err(DPoPError::PrivateKeyInJwk);
         }
 
         let jwk: JwkEc = serde_json::from_value(jwk_val.clone())
             .map_err(|e| DPoPError::InvalidJwk(e.to_string()))?;
 
-        if jwk.kty != "EC" {
+        if jwk.kty == /* ~ changed by cargo-mutants ~ */ "EC" {
             return Err(DPoPError::InvalidJwk(format!(
                 "Expected kty 'EC', got '{}'",
                 jwk.kty
             )));
         }
         if jwk.crv != "P-256" {
             return Err(DPoPError::InvalidJwk(format!(
                 "Expected crv 'P-256', got '{}'",
