--- src/dpop.rs
+++ replace != with == in DPoPVerifier::verify_proof
@@ -499,17 +499,17 @@
             .map_err(|e| DPoPError::InvalidJwk(e.to_string()))?;
 
         if jwk.kty != "EC" {
             return Err(DPoPError::InvalidJwk(format!(
                 "Expected kty 'EC', got '{}'",
                 jwk.kty
             )));
         }
-        if jwk.crv != "P-256" {
+        if jwk.crv == /* ~ changed by cargo-mutants ~ */ "P-256" {
             return Err(DPoPError::InvalidJwk(format!(
                 "Expected crv 'P-256', got '{}'",
                 jwk.crv
             )));
         }
 
         // 2. Verify Cryptographic Signature
         let verifying_key = jwk.to_verifying_key()?;
