--- src/dpop.rs
+++ delete ! in DPoPVerifier::verify_proof
@@ -543,17 +543,17 @@
                 actual: claims.htu,
             });
         }
 
         // Nonce verification
         if let Some(exp_nonce) = expected_nonce {
             match &claims.nonce {
                 Some(actual_nonce) => {
-                    if !constant_time_eq(exp_nonce.as_bytes(), actual_nonce.as_bytes()) {
+                    if  /* ~ changed by cargo-mutants ~ */constant_time_eq(exp_nonce.as_bytes(), actual_nonce.as_bytes()) {
                         return Err(DPoPError::NonceMismatch {
                             expected: exp_nonce.to_string(),
                             actual: actual_nonce.clone(),
                         });
                     }
                 }
                 None => return Err(DPoPError::MissingNonce),
             }
