--- src/dpop.rs
+++ delete ! in DPoPVerifier::verify_proof
@@ -558,17 +558,17 @@
                 None => return Err(DPoPError::MissingNonce),
             }
         }
 
         // Access token hash (ath) verification
         if let Some(exp_ath) = expected_ath {
             match &claims.ath {
                 Some(actual_ath) => {
-                    if !constant_time_eq(exp_ath.as_bytes(), actual_ath.as_bytes()) {
+                    if  /* ~ changed by cargo-mutants ~ */constant_time_eq(exp_ath.as_bytes(), actual_ath.as_bytes()) {
                         return Err(DPoPError::AthMismatch {
                             expected: exp_ath.to_string(),
                             actual: actual_ath.clone(),
                         });
                     }
                 }
                 None => return Err(DPoPError::MissingAth),
             }
