--- src/dpop.rs
+++ replace > with == in DPoPVerifier::verify_proof
@@ -585,17 +585,17 @@
                 .map_err(|e| DPoPError::ClockSkew(e.to_string()))?
                 .as_secs(),
         };
 
         let skew_secs = self.max_clock_skew.as_secs();
         let max_age_secs = self.max_proof_age.as_secs();
 
         // Check if iat is in future beyond clock skew leeway
-        if claims.iat > now.saturating_add(skew_secs) {
+        if claims.iat == /* ~ changed by cargo-mutants ~ */ now.saturating_add(skew_secs) {
             return Err(DPoPError::FutureProof {
                 iat: claims.iat,
                 now,
                 leeway: skew_secs,
             });
         }
 
         // Check proof age
