--- src/dpop.rs
+++ replace normalize_htu -> Result<String, DPoPError> with Ok("xyzzy".into())
@@ -658,47 +658,17 @@
 /// - Lowercases scheme and host.
 /// - Removes default ports (HTTP 80, HTTPS 443).
 /// - Preserves path casing and normalizes empty path to `/` if appropriate.
 ///
 /// # Errors
 ///
 /// Returns [`DPoPError::InvalidUri`] if the input is not a valid absolute HTTP/HTTPS URI.
 pub fn normalize_htu(uri_str: &str) -> Result<String, DPoPError> {
-    let trimmed = uri_str.trim();
-    if trimmed.is_empty() {
-        return Err(DPoPError::InvalidUri(
-            "URI string cannot be empty".to_string(),
-        ));
-    }
-
-    let parsed = Url::parse(trimmed)
-        .map_err(|e| DPoPError::InvalidUri(format!("Malformed URI '{trimmed}': {e}")))?;
-
-    let scheme = parsed.scheme().to_ascii_lowercase();
-    if scheme != "http" && scheme != "https" {
-        return Err(DPoPError::InvalidUri(format!(
-            "URI scheme must be 'http' or 'https', got '{scheme}'"
-        )));
-    }
-
-    let host = parsed
-        .host_str()
-        .ok_or_else(|| DPoPError::InvalidUri("URI is missing host".to_string()))?
-        .to_ascii_lowercase();
-
-    let port_str = match (scheme.as_str(), parsed.port()) {
-        ("http", Some(80)) | ("https", Some(443)) | (_, None) => String::new(),
-        (_, Some(p)) => format!(":{p}"),
-    };
-
-    let path = parsed.path();
-    let normalized_path = if path.is_empty() { "/" } else { path };
-
-    Ok(format!("{scheme}://{host}{port_str}{normalized_path}"))
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extracts a server-issued challenge nonce from an optional header string.
 ///
 /// Trims whitespace and returns `Some(nonce)` if non-empty, or `None` if absent or whitespace-only.
 ///
 /// # Examples
 ///
