--- src/dpop.rs
+++ replace != with == in normalize_htu
@@ -669,17 +669,17 @@
             "URI string cannot be empty".to_string(),
         ));
     }
 
     let parsed = Url::parse(trimmed)
         .map_err(|e| DPoPError::InvalidUri(format!("Malformed URI '{trimmed}': {e}")))?;
 
     let scheme = parsed.scheme().to_ascii_lowercase();
-    if scheme != "http" && scheme != "https" {
+    if scheme == /* ~ changed by cargo-mutants ~ */ "http" && scheme != "https" {
         return Err(DPoPError::InvalidUri(format!(
             "URI scheme must be 'http' or 'https', got '{scheme}'"
         )));
     }
 
     let host = parsed
         .host_str()
         .ok_or_else(|| DPoPError::InvalidUri("URI is missing host".to_string()))?
