--- src/dpop.rs
+++ replace extract_dpop_nonce -> Option<String> with Some(String::new())
@@ -706,24 +706,17 @@
 /// use skyauth::dpop::extract_dpop_nonce;
 ///
 /// assert_eq!(extract_dpop_nonce(Some("nonce-xyz")), Some("nonce-xyz".to_string()));
 /// assert_eq!(extract_dpop_nonce(None), None);
 /// assert_eq!(extract_dpop_nonce(Some("   ")), None);
 /// ```
 #[must_use]
 pub fn extract_dpop_nonce(header_val: Option<&str>) -> Option<String> {
-    header_val.and_then(|v| {
-        let trimmed = v.trim();
-        if trimmed.is_empty() {
-            None
-        } else {
-            Some(trimmed.to_string())
-        }
-    })
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Origin-keyed in-memory cache for server-issued DPoP challenge nonces.
 ///
 /// Automatically tracks and updates the latest nonce for each Authorization Server
 /// and Protected Resource origin.
 #[derive(Debug, Default, Clone)]
 pub struct DPoPNonceCache {
