--- src/dpop.rs
+++ replace DPoPNonceCache::get_nonce -> Option<String> with None
@@ -743,18 +743,17 @@
     pub fn set_nonce(&self, origin: &str, nonce: impl Into<String>) {
         let mut guard = self.cache.write();
         guard.insert(origin.trim().to_ascii_lowercase(), nonce.into());
     }
 
     /// Retrieves the current challenge nonce for an origin URL, if available.
     #[must_use]
     pub fn get_nonce(&self, origin: &str) -> Option<String> {
-        let guard = self.cache.read();
-        guard.get(&origin.trim().to_ascii_lowercase()).cloned()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Clears the cached nonce for an origin URL.
     pub fn clear_nonce(&self, origin: &str) {
         let mut guard = self.cache.write();
         guard.remove(&origin.trim().to_ascii_lowercase());
     }
 }
