--- src/dpop.rs
+++ replace DPoPNonceCache::clear_nonce with ()
@@ -749,18 +749,17 @@
     #[must_use]
     pub fn get_nonce(&self, origin: &str) -> Option<String> {
         let guard = self.cache.read();
         guard.get(&origin.trim().to_ascii_lowercase()).cloned()
     }
 
     /// Clears the cached nonce for an origin URL.
     pub fn clear_nonce(&self, origin: &str) {
-        let mut guard = self.cache.write();
-        guard.remove(&origin.trim().to_ascii_lowercase());
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// In-memory 64-shard partitioned concurrent cache for tracking consumed DPoP `jti` identifiers.
 ///
 /// Prevents DPoP proof replay attacks within the acceptance time window per RFC 9449 § 4.3 and § 11.1.
 /// Keyed on `(jkt, jti)` composite identifiers to enforce uniqueness per public key thumbprint.
 ///
