--- src/dpop.rs
+++ replace % with + in DPoPReplayCache::shard_index
@@ -799,17 +799,17 @@
         }
     }
 
     #[inline]
     pub(crate) fn shard_index(&self, key: &str) -> usize {
         use std::hash::{BuildHasher, Hasher};
         let mut hasher = self.hasher.build_hasher();
         hasher.write(key.as_bytes());
-        (hasher.finish() as usize) % NUM_SHARDS
+        (hasher.finish() as usize) + /* ~ changed by cargo-mutants ~ */ NUM_SHARDS
     }
 
     #[inline]
     fn shard_for(&self, key: &str) -> &RwLock<HashMap<String, u64>> {
         let idx = self.shard_index(key);
         &self.shards[idx]
     }
 
