--- src/dpop.rs
+++ replace DPoPReplayCache::shard_for -> &RwLock<HashMap<String, u64>> with Box::leak(Box::new(RwLock::new(HashMap::from_iter([("xyzzy".into(), 0)]))))
@@ -804,18 +804,17 @@
         use std::hash::{BuildHasher, Hasher};
         let mut hasher = self.hasher.build_hasher();
         hasher.write(key.as_bytes());
         (hasher.finish() as usize) % NUM_SHARDS
     }
 
     #[inline]
     fn shard_for(&self, key: &str) -> &RwLock<HashMap<String, u64>> {
-        let idx = self.shard_index(key);
-        &self.shards[idx]
+        Box::leak(Box::new(RwLock::new(HashMap::from_iter([("xyzzy".into(), 0)])))) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checks if a `(jkt, jti)` pair has already been consumed and is still valid (not expired).
     ///
     /// If not consumed, atomically records the entry with expiration timestamp `expires_at_secs`.
     ///
     /// # Errors
     ///
