--- src/dpop.rs
+++ replace DPoPReplayCache::check_and_record -> Result<(), DPoPError> with Ok(())
@@ -822,49 +822,17 @@
     /// Returns [`DPoPError::ReplayDetected`] if the `jti` was already consumed and has not yet expired.
     pub fn check_and_record(
         &self,
         jkt: &str,
         jti: &str,
         expires_at_secs: u64,
         now_secs: u64,
     ) -> Result<(), DPoPError> {
-        let composite_key = format!("{jkt}:{jti}");
-        let shard_idx = self.shard_index(&composite_key);
-        let shard = &self.shards[shard_idx];
-        let mut guard = shard.write();
-
-        // 1. Check if key already exists and is unexpired
-        if let Some(&existing_exp) = guard.get(&composite_key) {
-            if existing_exp > now_secs {
-                return Err(DPoPError::ReplayDetected {
-                    jti: jti.to_string(),
-                });
-            }
-        }
-
-        // 2. Amortized lazy pruning: run the O(n) retain pass at most once per
-        //    64 admissions per shard instead of on every call.
-        let admissions = self.prune_hints[shard_idx].fetch_add(1, Ordering::Relaxed);
-        if guard.len() > 512 && admissions % 64 == 0 {
-            guard.retain(|_, &mut exp| exp > now_secs);
-        }
-
-        // Strict shard capacity cap to prevent memory exhaustion without evicting live
-        // proofs. Expired entries are always prunable; only live admission is refused.
-        if guard.len() >= 2048 {
-            guard.retain(|_, &mut exp| exp > now_secs);
-            if guard.len() >= 2048 {
-                return Err(DPoPError::ReplayCacheSaturated);
-            }
-        }
-
-        // 3. Record the consumed JTI
-        guard.insert(composite_key, expires_at_secs);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checks if a `(jkt, jti)` has been consumed without modifying state.
     #[must_use]
     pub fn is_consumed(&self, jkt: &str, jti: &str, now_secs: u64) -> bool {
         let composite_key = format!("{jkt}:{jti}");
         let shard = self.shard_for(&composite_key);
         let guard = shard.read();
