--- src/dpop.rs
+++ replace > with == in DPoPReplayCache::check_and_record
@@ -839,17 +839,17 @@
                     jti: jti.to_string(),
                 });
             }
         }
 
         // 2. Amortized lazy pruning: run the O(n) retain pass at most once per
         //    64 admissions per shard instead of on every call.
         let admissions = self.prune_hints[shard_idx].fetch_add(1, Ordering::Relaxed);
-        if guard.len() > 512 && admissions % 64 == 0 {
+        if guard.len() == /* ~ changed by cargo-mutants ~ */ 512 && admissions % 64 == 0 {
             guard.retain(|_, &mut exp| exp > now_secs);
         }
 
         // Strict shard capacity cap to prevent memory exhaustion without evicting live
         // proofs. Expired entries are always prunable; only live admission is refused.
         if guard.len() >= 2048 {
             guard.retain(|_, &mut exp| exp > now_secs);
             if guard.len() >= 2048 {
