--- src/dpop.rs
+++ replace >= with < in DPoPReplayCache::check_and_record
@@ -847,17 +847,17 @@
         if guard.len() > 512 && admissions % 64 == 0 {
             guard.retain(|_, &mut exp| exp > now_secs);
         }
 
         // Strict shard capacity cap to prevent memory exhaustion without evicting live
         // proofs. Expired entries are always prunable; only live admission is refused.
         if guard.len() >= 2048 {
             guard.retain(|_, &mut exp| exp > now_secs);
-            if guard.len() >= 2048 {
+            if guard.len() < /* ~ changed by cargo-mutants ~ */ 2048 {
                 return Err(DPoPError::ReplayCacheSaturated);
             }
         }
 
         // 3. Record the consumed JTI
         guard.insert(composite_key, expires_at_secs);
         Ok(())
     }
