--- src/dpop.rs
+++ replace DPoPReplayCache::is_consumed -> bool with false
@@ -860,24 +860,17 @@
         // 3. Record the consumed JTI
         guard.insert(composite_key, expires_at_secs);
         Ok(())
     }
 
     /// Checks if a `(jkt, jti)` has been consumed without modifying state.
     #[must_use]
     pub fn is_consumed(&self, jkt: &str, jti: &str, now_secs: u64) -> bool {
-        let composite_key = format!("{jkt}:{jti}");
-        let shard = self.shard_for(&composite_key);
-        let guard = shard.read();
-        if let Some(&exp) = guard.get(&composite_key) {
-            exp > now_secs
-        } else {
-            false
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Explicitly prunes all expired entries across all shards.
     pub fn prune_expired(&self, now_secs: u64) {
         for shard in self.shards.iter() {
             let mut guard = shard.write();
             guard.retain(|_, &mut exp| exp > now_secs);
         }
