--- src/dpop.rs
+++ replace > with >= in DPoPReplayCache::is_consumed
@@ -864,17 +864,17 @@
 
     /// Checks if a `(jkt, jti)` has been consumed without modifying state.
     #[must_use]
     pub fn is_consumed(&self, jkt: &str, jti: &str, now_secs: u64) -> bool {
         let composite_key = format!("{jkt}:{jti}");
         let shard = self.shard_for(&composite_key);
         let guard = shard.read();
         if let Some(&exp) = guard.get(&composite_key) {
-            exp > now_secs
+            exp >= /* ~ changed by cargo-mutants ~ */ now_secs
         } else {
             false
         }
     }
 
     /// Explicitly prunes all expired entries across all shards.
     pub fn prune_expired(&self, now_secs: u64) {
         for shard in self.shards.iter() {
