--- src/dpop.rs
+++ replace > with == in DPoPReplayCache::prune_expired
@@ -874,17 +874,17 @@
             false
         }
     }
 
     /// Explicitly prunes all expired entries across all shards.
     pub fn prune_expired(&self, now_secs: u64) {
         for shard in self.shards.iter() {
             let mut guard = shard.write();
-            guard.retain(|_, &mut exp| exp > now_secs);
+            guard.retain(|_, &mut exp| exp == /* ~ changed by cargo-mutants ~ */ now_secs);
         }
     }
 
     /// Returns the total number of cached entries across all shards.
     #[must_use]
     pub fn len(&self) -> usize {
         self.shards.iter().map(|s| s.read().len()).sum()
     }
