--- src/dpop.rs
+++ replace DPoPReplayCache::len -> usize with 0
@@ -881,17 +881,17 @@
             let mut guard = shard.write();
             guard.retain(|_, &mut exp| exp > now_secs);
         }
     }
 
     /// Returns the total number of cached entries across all shards.
     #[must_use]
     pub fn len(&self) -> usize {
-        self.shards.iter().map(|s| s.read().len()).sum()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the cache contains no entries.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.len() == 0
     }
 
