--- src/dpop.rs
+++ replace == with != in DPoPReplayCache::is_empty
@@ -887,17 +887,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.shards.iter().map(|s| s.read().len()).sum()
     }
 
     /// Returns `true` if the cache contains no entries.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.len() == 0
+        self.len() != /* ~ changed by cargo-mutants ~ */ 0
     }
 
     /// Clears all entries from the cache.
     pub fn clear(&self) {
         for shard in self.shards.iter() {
             let mut guard = shard.write();
             guard.clear();
         }
