--- src/dpop.rs
+++ replace DPoPReplayCache::clear with ()
@@ -892,20 +892,17 @@
     /// Returns `true` if the cache contains no entries.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.len() == 0
     }
 
     /// Clears all entries from the cache.
     pub fn clear(&self) {
-        for shard in self.shards.iter() {
-            let mut guard = shard.write();
-            guard.clear();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Server-side DPoP challenge nonce generation and verification per RFC 9449 § 8.
 pub trait DPoPServerNonceSource: Send + Sync + 'static {
     /// Generates a fresh challenge nonce.
     fn generate_nonce(&self) -> String;
     /// Verifies whether the presented nonce is valid and active.
