--- src/dpop.rs
+++ replace <impl DPoPServerNonceSource for Arc<T>>::verify_nonce -> bool with true
@@ -913,17 +913,17 @@
 }
 
 impl<T: DPoPServerNonceSource + ?Sized> DPoPServerNonceSource for Arc<T> {
     fn generate_nonce(&self) -> String {
         (**self).generate_nonce()
     }
 
     fn verify_nonce(&self, nonce: &str) -> bool {
-        (**self).verify_nonce(nonce)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// In-memory implementation of [`DPoPServerNonceSource`] tracking nonces with time-to-live.
 #[derive(Debug, Clone)]
 pub struct InMemoryServerNonceSource {
     nonces: Arc<RwLock<HashMap<String, u64>>>,
     ttl: Duration,
